[
  {
    "jsonb_agg": [
      {
        "project_name": "Abby-Sitgraves-MVA-7-13-2024",
        "client_name": "Abby Sitgraves",
        "case_summary": "Motor vehicle accident case involving Abby Sitgraves who sustained ankle and knee sprains on July 13, 2024, when involved in an accident with a CAAL Worldwide limousine driven by Michelle Andrews. Case filed in Jefferson Circuit Court (Case No. 25-CI-000133) against defendants CAAL Worldwide, Inc. and Frederick Moore. Client treated at Jewish Hospital, UofL Physicians, Foundation Radiology, and UofL Physicians - Orthopedics with total medical bills of $4,085.00. Discovery phase completed with motion to compel granted May 2025. Settlement demands sent June 30, 2025 to defense counsel for uninsured motorist claims through National Indemnity Company ($10,000 PIP coverage available, Claim #633859-N, Adjuster: Jordan Bahr 402-916-3036). Defense counsel confirmed belief in $10,000 PIP coverage but UM claims on hold pending completion of treatment for co-plaintiff. Outstanding lien from Key Benefit Administrators for $358.51. Overdue to-dos: obtaining client's insurance card photos for UIM claim and follow-up with defense counsel on settlement demands. Client provided insurance information via text June 18, 2025. Depositions may need to be scheduled.",
        "current_status": "Post-Discovery Settlement Negotiations - UM Claims Pending",
        "last_status_update": "2025-09-12T06:38:58.47955+00:00",
        "client_address": "3421 Heatherfield Dr., Louisville, KY 40216",
        "client_phone": "502-210-1388",
        "client_email": "abbysitgraves01@gmail.com",
        "accident_date": "2024-07-13",
        "total_medical_bills": 4085,
        "total_expenses": 187.96,
        "total_liens": 358.51,
        "case_last_activity": "11/19/2025 03:44 PM",
        "case_create_date": "2024-07-18",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Abigail-Whaley-MVA-10-24-2024",
        "client_name": "Abigail Whaley",
        "case_summary": "Motor vehicle accident case for client Abigail Whaley involving October 24, 2024 collision. Police report obtained from St. Matthews PD (Officer R. Banta, Report #STM242451). Vehicle towed to Tony's Wrecker Service. Two insurance carriers involved: SafeCo Insurance (PIP coverage, claim #58147807, adjuster Lauren Smith) and American Family Insurance (BI coverage, claim #1008251706, adjuster Laura Zahringer, policy limits $100K/$300K/$100K). Letters of representation sent to both carriers on October 31, 2024 and acknowledged. Vehicle determined total loss by SafeCo appraiser. American Family has requested medical records and bills and sent Medicare inquiry form to client. Accident photos provided to American Family. Need to obtain medical treatment information and records.",
        "current_status": "File Setup - Letters of representation sent and acknowledged by both insurance carriers. SafeCo has confirmed total loss on vehicle. American Family requesting medical records and Medicare beneficiary status form. Awaiting client medical treatment information to proceed with records requests.",
        "last_status_update": "2025-09-11T21:57:36.582188+00:00",
        "client_address": "",
        "client_phone": "",
        "client_email": "agwhaley@yahoo.com",
        "accident_date": "2024-10-24",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2024-10-28",
        "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Alma-Cristobal-MVA-2-15-2024",
        "client_name": "Alma Socorro Cristobal Avendao",
        "case_summary": "On February 15, 2024, Plaintiff Alma Socorro Cristobal Avendaño was traveling northbound in the right lane on Interstate 65 in Louisville, Kentucky, when she was involved in a sideswipe collision with a commercial truck operated by Roy Hamilton and owned by Crete Carrier Corporation. According to the police report, Ms. Cristobal was struck when Hamilton merged into her lane, forcing her into the guardrail. She sustained a fractured left clavicle, chest pain, and shoulder pain, requiring emergency treatment at UofL Health - Mary & Elizabeth Hospital via EMS transport.\n\nMs. Cristobal has received extensive medical treatment including: emergency care at UofL hospitals, imaging at Heartland Imaging confirming the clavicular fracture, ongoing treatment at Aptiva Health (4/2/24-9/18/24), and chiropractic care at Starlite Chiropractic. Total medical expenses exceed $24,000, with approximately $9,540 paid through PIP benefits (Kentucky Farm Bureau claim #4943385, adjuster Lauren Baker) which are now exhausted.\n\nA lawsuit was filed in Jefferson County Circuit Court (24-CI-004728) with active litigation ongoing. Defense counsel Aletha Thomas (Kopka Pinkus Dolin) represents Crete Carrier Corporation, which initially denied liability through their BI coverage (claim #2024346878, adjuster Brenna Rine) on 4/4/24. \n\nDiscovery has been contentious, with multiple rounds of supplemental requests served regarding the commercial vehicle's Electronic Data Recorder (EDR) information. Defendant Hamilton claimed during deposition that no collision occurred while he was driving, alleging any damage happened later while parked - a position we dispute based on physical evidence. Defense counsel has been non-responsive to supplemental discovery requests about EDR data, leading to multiple follow-up communications from April through July 2025. A motion to compel discovery has been drafted and is ready for filing if defense responses are not received promptly.",
        "current_status": "Depositions completed. Motion to compel supplemental discovery regarding EDR information drafted and ready to file. Awaiting defense counsel's responses to supplemental discovery requests served in April 2025 - multiple follow-ups sent with no response. PIP benefits exhausted. BI carrier denied liability but case proceeding in litigation. Next action: File motion to compel if no response received from defense counsel soon.",
        "last_status_update": "2025-09-12T06:42:04.695256+00:00",
        "client_address": "1205 Carriage Way Ct., Fairdale, KY 40118",
        "client_phone": "502-807-8428",
        "client_email": "almita_gc@hotmail.com",
        "accident_date": "2024-02-15",
        "total_medical_bills": 24507,
        "total_expenses": 340.98,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2024-02-21",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Amy-Mills-Premise-04-26-2019",
        "client_name": "Amy Mills",
        "case_summary": "Amy Mills premise liability case - slip and fall on marble floor at Forcht Bank on 4/26/2019. Client suffered significant injuries including cervical fusion by Dr. Shields, shoulder labral repair by Dr. Khalily, chronic migraines, and ongoing neck/shoulder pain. Currently in litigation phase in Knox County Circuit Court (Case No. 20-CI-00112) against Forcht Bank. Medical treatment ongoing with disagreement between providers at Bluegrass Ortho (Drs. Huff/Hunt) on whether neck or shoulder is primary issue. Client treating with Dr. Magone (sports surgeon, London KY). Business (Bella Beauty Institute) bankrupt due to inability to work. Major medical bills include Norton Hospital Downtown ($106,582.53), Baptist Health Corbin ($46,021.44), and numerous other providers totaling significant damages.",
        "current_status": "URGENT: Discovery compliance issues. Court ordered client discovery responses due 12/26/2024 - defendant filed motion for contempt in January 2025. Need immediate action on discovery response. Case in active litigation with extensive medical damages documented. Awaiting expert medical review for life care planning per communications with PMR Life Care Plans. Need to address discovery deadline violations to avoid sanctions.",
        "last_status_update": "2025-09-12T01:42:16.730012+00:00",
        "client_address": "200 Meadow Lark Circle, , Corbin, KY 40701",
        "client_phone": "606-304-0342 Main",
        "client_email": "bellabeautyinstitute@gmail.com",
        "accident_date": "2019-04-26",
        "total_medical_bills": 180253.93,
        "total_expenses": 8778,
        "total_liens": 29121.89,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2022-01-05",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Amy-Stich-WC-01-17-2024",
        "client_name": "Amy Stich",
        "case_summary": "Amy Stich Workers' Compensation and Premise Liability case from 1/17/2024 workplace injury while delivering catering for Moe's Southwest Grill at NeuroRestorative (11901 Shelbyville Rd, Louisville KY). Client sustained left bicep tendon tear requiring surgical repair completed 8/13/2024 at Norton Women's & Children's Hospital. Dual claims: 1) WC claim with Hartford Mutual Insurance (claim #237484CS, adjuster Kristi Goldener), 2) Premise liability against NeuroRestorative with Lewis Brisbois (adjuster Judd Uhl). Current status: Client continuing PT post-surgery with work restrictions (light duty, no lifting over 10lbs), next re-evaluation 2/14/2025. Major ongoing issue: Hartford Mutual has been unresponsive regarding TTD payments - last payment received 12/05/2024. Client experiencing significant financial stress and wants to reach MMI due to inability to work full-time. Medical providers include Baptist Health Urgent Care ($223 billed), Baptist Health Orthopedics, Heartland Imaging, Ellis & Badenhausen Orthopaedics, Norton Hospital, and Universal Anesthesia Services. Extensive documentation in file including medical records, operative reports, work restrictions, and correspondence with insurers.",
        "current_status": "Treatment Phase - Post-Surgical Recovery. Client continuing physical therapy following 8/13/2024 left bicep repair surgery. Critical issue: Hartford Mutual adjuster Kristi Goldener has been unreliable and unresponsive - no TTD payments received since 12/05/2024 despite multiple follow-up attempts. Client under significant financial stress working reduced hours with lifting restrictions. Upcoming 2/14/2025 re-evaluation may determine MMI status. Premise liability claim with Lewis Brisbois remains open. Priority actions: 1) Urgent follow-up on TTD payment delays with Hartford Mutual, 2) Monitor client's progress toward MMI, 3) Request updated medical records from all providers, 4) Address client's tax documentation concerns. Case well-documented with comprehensive medical records and extensive correspondence file.",
        "last_status_update": "2025-09-11T06:42:06.662142+00:00",
        "client_address": "10217 Saint Rene Road, Louisville, KY 40299",
        "client_phone": "(502) 715-7016",
        "client_email": "redroses13us@outlook.com",
        "accident_date": "2024-01-17",
        "total_medical_bills": 223,
        "total_expenses": 550,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2024-02-19",
        "phase": "Treatment",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Anella-Noble-MVA-01-03-2021",
        "client_name": "Anella Noble",
        "case_summary": "On January 3, 2021, Plaintiff Anella Noble was a passenger in a vehicle on Westhall Avenue at Wilderness Road in Louisville, Kentucky, when they were struck from behind by a vehicle operated by an individual who fled the scene on foot immediately after the collision. Client was very pregnant at the time and was transported to Baptist Health Louisville by Louisville Metro EMS.\n\nThe driver of the striking vehicle was not present when officers arrived. The registered owner, Virginia Sewell, later reported the vehicle as stolen approximately 20 minutes after the collision. The police noted that the push-to-start vehicle showed no signs of ignition damage. Officers questioned Sewell about the keys, and she initially stated she only had one set, later revising her statement to say a spare key existed but had not been located. In her deposition, Sewell testified she did not know who had taken her vehicle but admitted speaking with her boyfriend before filing the theft report.\n\nPARTIES: Case filed against Virginia Sewell and Estate of DeShawn Ford (originally her boyfriend who was driving - now deceased). \n\nLITIGATION STATUS: Third Amended Complaint filed 9/12/2023. Depositions completed of Anella Noble (6/21/2022) and Virginia Sewell (3/23/2023). State Farm dismissed from case (12/4/2023).\n\nMEDICAL TREATMENT: Client treated by Louisville Metro EMS, Baptist Health Louisville, Louisville Emergency Medical Associates, OB Hospitalist Group, The Injury Centers, Bluegrass Bone & Joint, and Etown Chiropractic Center. Total medical bills: $10,407.39.\n\nINSURANCE: Three insurance companies involved: Aetna Life (Medicaid), Anthem Medicaid Health Plans (PHI), and Safeco Insurance (KAC). All coverage confirmed.\n\nDEFENSE COUNSEL: Renee Hoskins (Smith & Hoskins) for Virginia Sewell; David Klapheke (Dinsmore) for Estate of DeShawn Ford.\n\nFILE ORGANIZATION: Comprehensive file organization completed 11/30/2025 using 8-bucket system with content-based naming. 395+ files inventoried, 8 files successfully reorganized into proper structure. Files now properly categorized and easily retrievable.",
        "current_status": "Discovery phase ongoing. Depositions completed for parties. Officer Nathaniel Lovewell deposition scheduled/completed 8/14/2024. Body cam footage from Officers Lovewell and Pond obtained and provided to defense counsel 2/10/2025. LMPD confirmed no RTCC footage or photos available. Still pending: discussion with Rob Mattingly about police officer contact (due 9/3/2025). EMS bills and records sent to Safeco adjuster 8/14/2024 for payment. Need to follow up on medical record requests for all providers and finalize discovery before proceeding to trial preparation. File organization completed 11/30/2025 - case files now organized in 8-bucket structure with standardized naming.",
        "last_status_update": "2025-11-30T22:58:00.000000+00:00",
        "client_address": "635 Elliston Dr, , Gonzales, LA 70737",
        "client_phone": "502-994-3654 Main",
        "client_email": "anellacn@gmail.com",
        "accident_date": "2021-01-03",
        "total_medical_bills": 10407.39,
        "total_expenses": 2434.77,
        "total_liens": 0,
        "case_last_activity": "11/30/2025 10:58 PM",
        "case_create_date": "2021-12-15",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Ashlee-Williams-MVA-08-29-2023",
        "client_name": "Ashlee K. Williams",
        "case_summary": "MVA on 8/29/23 in Indiana where client Ashlee K. Williams was passenger in vehicle driven by Julmonzhae Moore that turned left in front of vehicle driven by Dewayne Ward. Client suffered post-traumatic headaches, seizure, and loss of consciousness. Transported by EMS to UofL Hospital. Total medical bills $35,138.24. Four parties injured: Williams, Moore, Graham, and Robinson. One BI settlement completed with Liberty Mutual for $18,000 on 9/12/24. State Farm denied liability on 2/12/24. Litigation ongoing in Floyd County, IN (case 22D03-2501-CT-000157). Discovery phase active with responses provided by all plaintiffs. Kentucky Pain Associates has medical lien on file.",
        "current_status": "Active litigation in Indiana federal court. Liberty Mutual BI claim settled for $18,000 (9/12/24). State Farm continues to deny liability despite demand sent 1/10/24. Discovery responses submitted 7/28/25. Awaiting next procedural steps in litigation. PIP benefits active through Liberty Mutual. All medical treatment completed 10/12/23. Case ready for trial preparation phase.",
        "last_status_update": "2025-09-12T06:46:20.952462+00:00",
        "client_address": "8923 Preston Hwy, Apt 308, Louisville, KY 40219",
        "client_phone": "502-689-7599",
        "client_email": "ashlee.williams1247@gmail.com",
        "accident_date": "2023-08-29",
        "total_medical_bills": 35138.24,
        "total_expenses": 90.85,
        "total_liens": 172.73,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2023-08-30",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Brenda-Lang-MVA-09-03-2021",
        "client_name": "Brenda D. Lang",
        "case_summary": "Brenda D. Lang v. Marcus Hamlet (Jefferson 23-CI-005931) - Motor vehicle accident on September 3, 2021 involving collision with Louisville Metro Government vehicle driven by defendant Marcus Hamlet. Client transported by EMS to Baptist Health for emergency treatment on 9/3/21 with follow-up ER visit on 9/12/21.\n\nMEDICAL TREATMENT: Client treated at multiple facilities including Baptist Health Louisville, Louisville Emergency Medical Associates, Norton Hospital, and received EMS transport from Louisville Metro EMS and Okolona Fire/EMS. Also treated at Baptist Health Hardin, Southern Medical Specialist, with pharmacy services from Gould's Discount Medical and radiology from Xray Associates of Louisville.\n\nMEDICAL DAMAGES: Total confirmed medical bills $26,234.72 (appendix-related treatment excluded from demand as unrelated). Major billings include Baptist Health ($20,569.18), Louisville Emergency Medical Associates ($1,642.00), Xray Associates ($1,749.50), Okolona Fire/EMS ($1,095.60), Louisville Metro EMS ($821.40), and Gould's Discount Medical ($357.04).\n\nINSURANCE COVERAGE: Three policies identified - (1) State Farm PIP (claim #1724J054B, adjuster Steve Campbell), (2) TARC Risk Management BI coverage (claim #410220052, adjuster J. Clarke McCulloch), and (3) State Farm UIM (adjuster Randy Carney). All coverage confirmed.\n\nLITIGATION STATUS: Active lawsuit filed. Extensive discovery completed including depositions. Settlement negotiations ongoing with demands progressing from $150K (11/17/24) to revised $35K (01/27/25). Defense currently offering $15,000 (07/29/25). Case involves disputes over medical causation and liability.",
        "current_status": "CRITICAL ACTION REQUIRED: $15,000 settlement offer from TARC Risk Management received 07/29/25 remains unaddressed - client consultation OVERDUE since 09/05/25. Immediate client meeting needed to evaluate offer against $26K+ in medical bills. Pending issues include incomplete deposition transcript procurement and ongoing attempts to identify/depose additional Metro employees with incident knowledge (defense counsel non-responsive to witness inquiries). Next steps: (1) Schedule urgent client consultation re: $15K offer evaluation, (2) Follow up on missing deposition transcripts, (3) Press defense counsel for witness availability, (4) Complete outstanding medical records requests.",
        "last_status_update": "2025-09-12T01:57:30.668213+00:00",
        "client_address": "831 Suttcliff Ave, Louisville, KY 40211",
        "client_phone": "502-356-9430",
        "client_email": "brndlang010@gmail.com",
        "accident_date": "2021-09-03",
        "total_medical_bills": 26234.72,
        "total_expenses": 1305.91,
        "total_liens": 1513.45,
        "case_last_activity": "11/20/2025 04:59 PM",
        "case_create_date": "2023-05-19",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Brooklyn-Ballard-MVA-02-28-2024",
        "client_name": "Brooklyn Ballard",
        "case_summary": "Motor vehicle accident case for Brooklyn Ballard (minor) that occurred on February 28, 2024. Client sustained ankle injury requiring MRI, headache, nausea, vomiting, insomnia, and PTSD. Mother Elizabeth Ballard is primary contact (859) 479-5298. Medical treatment at St. Elizabeth Physicians-Crittenden (3/5/24, completed) and MEBS Counseling for PTSD (8/13/24, single visit). Three insurance carriers involved: Berkshire Risk Services (BI claim #OIC256504, adjuster Scott Frayer), State Farm PIP (claim #17-63X2-00X, adjuster Thomas Nie), and State Farm UM (same claim #, adjuster Stephanie Thomas). Medical bills: St. Elizabeth $852.00 (paid), MEBS Counseling $163.92 (paid), Cincinnati Children's Hospital $3,108.32 (outstanding). Major outstanding issue is obtaining medical records from Cincinnati Children's Hospital despite multiple follow-up attempts since 2024. Bellevue-Dayton EMS records show no patient found in database per ChartSwap. All insurance coverage currently showing as pending.",
        "current_status": "Awaiting medical records from Cincinnati Children's Hospital to complete demand package. Multiple follow-up attempts made since January 2025 with authorization forms submitted but records still not received. Outstanding medical bill of $3,108.32 from Cincinnati Children's Hospital needs resolution. Need to finalize all medical record collection and insurance coverage confirmations before proceeding with settlement demand to Berkshire Risk Services (BI carrier).",
        "last_status_update": "2025-09-12T06:46:53.335752+00:00",
        "client_address": "",
        "client_phone": "(859) 479-5298",
        "client_email": "",
        "accident_date": "2024-02-28",
        "total_medical_bills": 4124.24,
        "total_expenses": 50,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2024-03-04",
        "phase": "Demand in Progress",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Bryson-Brown-MVA-6-29-2025",
        "client_name": "Bryson Brown",
        "case_summary": "Motor vehicle accident case for Bryson Brown (DOB: 1/27/2007) injured on 6/29/2025 in Louisville. Client sustained neck, back, and right knee pain with minor injuries classification. Emergency treatment at UofL Mary & Elizabeth Hospital via EMS transport, then ongoing rehabilitation at Synergy starting 7/14/2025. Insurance coverage established with State Farm BI (Claim #1787F478S) and Allstate PIP (Claim #799220033, adjuster Guillermo Callejas). Police report SHV25-001156 obtained. Intake completed 7/11/2025 via Vinesign. Father Tymon Brown is previous firm client. Hospital records/bills received; EMS records requested but pending. Case moved to Treatment phase 7/29/2025. Statute of limitations: 6/29/2027.",
        "current_status": "Active treatment phase case. Client receiving ongoing rehabilitation at Synergy Injury Care. Both insurance companies notified with representation letters sent and acknowledged. Outstanding items: EMS medical records/bills still pending from Louisville Metro EMS. Next actions: Follow up on EMS records request, monitor Synergy treatment progress, obtain complete medical documentation when treatment concludes. Case progressing normally with proper insurance coverage coordination.",
        "last_status_update": "2025-09-12T06:48:12.407222+00:00",
        "client_address": "2002 Nelson, Shively, KY 40216",
        "client_phone": "502-500-3521",
        "client_email": "",
        "accident_date": "2025-06-29",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2025-07-07",
        "phase": "Treatment",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Caryn-McCay-MVA-7-30-2023",
        "client_name": "Caryn McCay",
        "case_summary": "Motor vehicle accident case for Caryn McCay dated 7/30/2023. State Farm BI settlement of $100,000 received 9/4/2024. Allstate UIM litigation filed 10/1/2024 (Fayette 24-CI-03580), currently in discovery phase with defense counsel Jennifer A. Peterson & Valerie W. Herbert (Travis Herbert & Stempien PLLC). Client has back and knee injuries with medical bills over $65k from 13+ providers. Client discovery responses filed 2/18/2025. Deposition scheduled for August 2025. Two overdue action items pending: case overview update and deposition/medicals/demand preparation.",
        "current_status": "UIM discovery phase active (Fayette 24-CI-03580). Client responses filed 2/18/2025. Depositions scheduled August 2025. Awaiting next litigation steps. Two overdue TO-DOs require immediate attention.",
        "last_status_update": "2025-09-12T06:49:36.900815+00:00",
        "client_address": "1001 McClanahan Ln, Lexington, KY 40509",
        "client_phone": "859-229-8183",
        "client_email": "bbncmccay@gmail.com",
        "accident_date": "2023-07-30",
        "total_medical_bills": 65029.44,
        "total_expenses": 6374.82,
        "total_liens": 43009,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2023-09-21",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Cecelia-Neltner-MVA-4-1-2023",
        "client_name": "Cecelia Neltner",
        "case_summary": "On April 1, 2023, Greg Neltner and his daughter, Cecelia Neltner, were involved in a motor\nvehicle collision on Burlington Pike (KY-18) in Florence, Kentucky. According to the police\nreport, the defendant, Trinity Cohara, attempted to cross three lanes of traffic from the far-right\neastbound lane in order to turn left onto the northbound I-75 on-ramp. In doing so, she turned\ndirectly in front of Mr. Neltner’s vehicle, which was traveling straight in the left eastbound lane.\nMr. Neltner had no time to react and struck Ms. Cohara’s vehicle. The police narrative confirms\nthat the defendant failed to yield and crossed lanes improperly, causing the crash. The defendant\ncontinued onto the ramp and stopped partway down.\nCecelia sustained minor burn-like injuries, believed to be from airbag deployment, which\ncaused redness, blistering, and rash-like symptoms. She was prescribed topical treatment but has\nsince recovered, and there is no indication of ongoing issues or permanent injury.",
        "current_status": "The top offer extended was $7,500 for Greg and $1,000 for Cecelia, which were both rejected. Defense counsel appears unlikely to increase these figures significantly without further records substantiating Greg’s ongoing treatment or a more detailed breakdown of his claimed lost income and limitations.",
        "last_status_update": null,
        "client_address": "317 W 13th St, Newport, KY 41071",
        "client_phone": "859-999-3086",
        "client_email": "cecelianeltner86@gmail.com",
        "accident_date": "2023-04-01",
        "total_medical_bills": 200,
        "total_expenses": 371.33,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2023-05-01",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Cecil-Finley-MVA-1-24-2024",
        "client_name": "Cecil Finley",
        "case_summary": "On January 24, 2024, Plaintiff Cecil Finley was traveling on South 3rd Street in Louisville, Kentucky, with passenger Dana Jackson when their vehicle was involved in a collision with defendant Justin Kiebler. According to the Louisville Metro Police Report, the crash occurred \"on roadway.\" Liability is disputed: client states defendant backed out of his driveway directly into client's lane of travel, while defendant claims he was fully in the roadway and moving when client rear-ended him.\n\nMEDICAL TREATMENT: Client treated at UofL Health Mary & Elizabeth Hospital ER (1/24/24 - $5,497), then chiropractic care at Starlite Chiropractic (1/31-4/2/24, 25 visits - $11,560 billed, $5,280 negotiated). Additional providers: Southeastern Emergency Physician Services ($1,266), University of Louisville Hospital Radiology, and Foundation Radiology.\n\nINSURANCE: State Farm (BI - defendant's coverage, adjuster Sharika Moses, claim #1762X766D) currently offering $6,000 vs. demanded $50,000. 20% comparative fault assigned to client. The General Insurance (client's PIP coverage, adjuster Dana Cohen, claim #1007187244).\n\nLITIGATION: Filed as Finley & Jackson v. Justin Kiebler (Jefferson 24-CI-005774). Defense counsel: Deborah C. Myers, Dilbeck & Myers PLLC. Judge: Hon. Jennifer Bryant Wilcox. Companion case with Dana Jackson. Discovery in progress, depositions need rescheduling.\n\nSPECIAL CIRCUMSTANCES: Client obtained legal lending loan for housing assistance, expressed financial hardship.",
        "current_status": "Case in litigation discovery phase. Depositions scheduled for 5/22/25 were missed on 7/9/25 (cancellation fee paid). Defense counsel provided rescheduling dates, but clients are difficult to reach. Pending action: Reschedule depositions with defense counsel Deborah Myers at Dilbeck & Myers and coordinate with clients (due 8/28/25). BI negotiations ongoing with State Farm - current offer $6,000 vs. demanded $50,000 (20% liability dispute).",
        "last_status_update": "2025-09-15T15:23:01.186002+00:00",
        "client_address": "154 East 7th Street, Lexington, KY 40508",
        "client_phone": "804-502-4096",
        "client_email": "1cecilremo@gmail.com",
        "accident_date": "2024-01-24",
        "total_medical_bills": 18323,
        "total_expenses": 223.2,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2024-02-06",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Charles-Godsey-MVA-6-30-2025",
        "client_name": "Charles Godsey",
        "case_summary": "Charles Godsey motor vehicle accident case from 6/30/2025 in Hazlewood, Louisville Metro area. Client (DOB: 3/27/86, SSN: 400-29-9540, Phone: 270-210-7382) sustained injuries to right side, lower back, neck, both shoulders, and right knee. Initial treatment at St. Mary Hospital, currently treating at Starlite Chiropractic. Intake signed 7/1/25. LORs sent to Kentucky Farm Bureau (PIP - Claim #5117901, Adjuster Casey May) and Progressive Insurance (BI - Claim #25631251364, Adjuster Joshua White) on 7/1/25. Both coverage confirmations pending. Police report and Starlite records/billing received. Client requested $1,000 legal funding. Missing St. Mary Hospital records/bills and insurance acknowledgments. Case overview update overdue since 8/29/25.",
        "current_status": "Treatment phase - Client ongoing care at Starlite Chiropractic. Awaiting insurance coverage confirmations from Kentucky Farm Bureau PIP and Progressive BI. Priority actions needed: Add St. Mary Hospital to medical_items table, request St. Mary records/bills, follow up on LOR acknowledgments, and complete overdue case overview update (due 8/29/25). Database synchronized with memory as of 9/15/25.",
        "last_status_update": "2025-09-15T21:11:47.977635+00:00",
        "client_address": "4408 Hazlewood Ave, Louisville, KY 40215",
        "client_phone": "270-210-7382",
        "client_email": "",
        "accident_date": "2025-06-30",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2025-07-01",
        "phase": "Treatment",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Charles-T-Johnson-MVA-4-18-2023",
        "client_name": "Charles T Johnson",
        "case_summary": "On April 18, 2023, client was involved in a collision at the intersection of West Main\nStreet and South 22nd Street in Louisville, Kentucky. According to the Louisville Metro Police\nCollision Report, Plaintiff was traveling southbound on 22nd Street and reported having a green\nlight when proceeding through the intersection. The other driver, traveling westbound on Market\nStreet, stated that he had a red light but proceeded into the intersection regardless. The two\nvehicles collided, pushing Plaintiff’s vehicle into a nearby car lot where it struck a parked\nvehicle.\nThere were no witnesses or traffic cameras capturing the incident, and the investigating\nofficer was unable to make a determination of fault. Body-worn camera footage from the scene is\nunfavorable to Plaintiff’s presentation. Settlement discussions are being approached on a 50/50\n\nfault allocation basis.",
        "current_status": "Negotiations are ongoing, and it is unclear what the defense will offer in light of our challenges.",
        "last_status_update": null,
        "client_address": "2652 Rowan St, , Louisville, KY 40212",
        "client_phone": "(502) 772-3731 Home",
        "client_email": "",
        "accident_date": "2023-04-18",
        "total_medical_bills": 13646.4,
        "total_expenses": 360.21,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2023-04-20",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Chase-Lindsey-MVA-12-01-2024",
        "client_name": null,
        "case_summary": "Chase Lindsey motor vehicle accident case from 12/01/2024. Chase suffered neck injuries requiring neck brace, back bruises (right side), and hip bruises (left side). Emergency transport provided by Florence Fire/EMS ($920) and emergency treatment at Cincinnati Children's Hospital ($20,298.94). Total medical expenses: $21,218.94. Insurance Coverage: Progressive Insurance (BI, claim #24-902741838, adjuster Jennifer Howard - coverage confirmed), Auto Owners Insurance (PIP, claim #300-793616-2024, adjuster Chandler Wolfe - coverage pending), Auto Owners Insurance (UIM, claim #300-793616-2024 - coverage pending). Key milestones: Medical records obtained from both providers, BI claim settled 7/28/2025, all medical bills paid in full via settlement, UIM demand sent to Auto Owners 7/28/2025. Documents include accident reports from Florence KY and Boone County SO, medical records/bills from both providers, injury photos, insurance correspondence, and settlement documentation.",
        "current_status": "UIM Phase - BI claim settled 7/28/2025, UIM demand sent to Auto Owners Insurance 7/28/2025 awaiting response. Medical bills totaling $21,218.94 paid in full via settlement (Florence Fire/EMS $920, Cincinnati Children's $20,298.94). All medical records obtained. Case progressing to underinsured motorist recovery phase.",
        "last_status_update": "2025-09-16T17:16:05.486283+00:00",
        "client_address": null,
        "client_phone": null,
        "client_email": null,
        "accident_date": "2024-12-01",
        "total_medical_bills": 21218.94,
        "total_expenses": 30,
        "total_liens": 17734.84,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2024-12-04",
        "phase": "Settlement",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Christopher-Lanier-MVA-6-28-2025",
        "client_name": "Christopher Lanier",
        "case_summary": "Christopher Lanier MVA case from June 28, 2025. Multi-family accident case (part of The-Laniers-MVA-8-28-2025 parent case). Client is treating at Allstar Chiropractic. Fee agreement and intake completed 8/7/2025. Letters of representation sent to State Farm (PIP) and Progressive (BI) on 8/7/2025. Awaiting insurance confirmation, claim numbers, and adjuster assignments. Medical records and bills not yet requested from Allstar Chiropractic. Case requires coordination with related family member cases for settlement strategy.",
        "current_status": "Initial file setup complete. Awaiting insurance claim confirmations from State Farm (PIP) and Progressive (BI). Need to obtain complete medical information from Allstar Chiropractic and coordinate with family settlement strategy.",
        "last_status_update": "2025-09-12T01:43:43.953356+00:00",
        "client_address": "1962 Hirsch Court\nUnion, KY 41091",
        "client_phone": "859-391-3435",
        "client_email": "unknown@unknown",
        "accident_date": "2025-06-28",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2025-09-05",
        "phase": "File Setup",
        "case_role": "child",
        "parent_project_name": "The-Laniers-MVA-8-28-2025"
      },
      {
        "project_name": "Christopher-Wilkerson-WC-MVA-02-15-2024",
        "client_name": "Christopher Wilkerson",
        "case_summary": "Christopher Wilkerson MVA on 2/15/24 - truck rollover during work (Nathan Bennett Trucking LLC). Non-collision \"road rage\" incident per police. Active WC claim (Hartford Mutual #238042cs - Debbie Smith) and PIP benefits (KY Farm Bureau #4943051 - Shellie Cooper). Client treating at Grant Chiropractic (since 3/20/24) and Taylor County Chiropractic (since 7/29/24) for back/spine injuries. BI coverage unavailable due to fault determination. Ephraim McDowell ER bill $14,143.80 paid. Statute of limitations: 2/15/26. Demand sent 3/19/25 for $42,703.85.",
        "current_status": "Negotiation phase - demand of $42,703.85 sent 3/19/25 to WC adjuster. Adjuster reviewing IME report and considering settlement response. WC claim accepted but still awaiting proper wage documentation for TTD benefits. PIP benefits reserved, waiting on updated wage info from WC. Client terminated from employment 8/12/24. Multiple client inquiries about settlement status (last 7/9/25). Need follow-up with adjuster on wage documentation and settlement response.",
        "last_status_update": "2025-09-12T06:56:08.429044+00:00",
        "client_address": "7300 Greensburg Road, Greensburg, KY 42743",
        "client_phone": "(270) 805-8189",
        "client_email": "chriswilk1970@gmail.com",
        "accident_date": "2024-02-15",
        "total_medical_bills": 14143.8,
        "total_expenses": 10,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2024-02-22",
        "phase": "Negotiation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Clarence-Robinson-Dual-WC-MVA-06-10-2021",
        "client_name": "Clarence Robinson",
        "case_summary": "Dual Workers' Compensation and Motor Vehicle Accident case from June 10, 2021. Commercial truck driver employed by BIR Transport injured while operating company vehicle. Federal lawsuit Robinson v. Eastern Express, Inc. et al (Case No. 3:23-cv-00048-GFVT-EBA) in Eastern District of Kentucky. Dr. Gregory Nazar's IME (March 2025) concluded plaintiff CANNOT RETURN TO EMPLOYMENT due to collision injuries. Workers' Compensation lien with Tech Insurance Company RESOLVED AND PAID for $17,000 (August 2025). CASE SETTLED for $35,000 with Old Republic Insurance (December 2025). Defense counsel Morgan Salisbury (Lewis Brisbois). Medical treatment: Baptist Health LaGrange, Knoxville Orthopedic Clinic, BenchMark Physical Therapy, Fast Pace Urgent Care, VA Medical Center. Total medical expenses $16,302.",
        "current_status": "SETTLEMENT PHASE - Case settled for $35,000 with Old Republic Insurance (December 2025). Awaiting client execution of settlement release documents. Follow-up scheduled for Monday, December 16, 2025. WC lien previously resolved for $17,000 paid to Tech Insurance Co. (August 2025). Strong medical evidence from Dr. Nazar IME showing plaintiff cannot return to work was key to settlement. Federal lawsuit Robinson v. Eastern Express, Inc. et al (Case No. 3:23-cv-00048-GFVT-EBA) resolved before January 2026 trial date.",
        "last_status_update": "2025-12-12T14:53:00.000000+00:00",
        "client_address": "638 Monroe Street, Madisonville, TN 37354",
        "client_phone": "(865) 924-5030",
        "client_email": "bonehead71115@gmail.com",
        "accident_date": "2021-06-10",
        "total_medical_bills": 16302.04,
        "total_expenses": 2350.42,
        "total_liens": 0,
        "case_last_activity": "12/12/2025 02:53 PM",
        "case_create_date": "2023-06-09",
        "phase": "Settlement",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Colleen-Colvin-MVA-10-01-2023",
        "client_name": "Colleen M. Colvin",
        "case_summary": "Motor vehicle collision case from 10/01/2023 in Elizabethtown, KY. Colleen and Shannon Colvin were struck by Paul Rafferty who ran a red light. Client suffered low back/right side pain, neck pain, and degenerative disc disease requiring ongoing treatment. Kentucky Farm Bureau denied coverage and filed counterclaim. Client's State Farm PIP coverage ($32.83 paid) and UM coverage available. Medical bills total $5,819.89 with $5,773.89 settled. Currently treating at Norton Community Medical with work accommodations at Amazon for standing limitations. Discovery responses completed 1/29/2025. Awaiting defendant's discovery responses before scheduling depositions.",
        "current_status": "Discovery phase - awaiting defendant Paul Rafferty's discovery responses to proceed with deposition scheduling. Kentucky Farm Bureau counterclaim pending. Client contact challenges due to phone issues. Next steps: follow-up on defendant's discovery responses, schedule depositions once received, address KFB counterclaim.",
        "last_status_update": "2025-09-12T07:02:13.703346+00:00",
        "client_address": "128 South St, Radcliff, KY 40160",
        "client_phone": "270-740-7320",
        "client_email": "heavens_angel_eyes_56@yahoo.com",
        "accident_date": "2023-10-01",
        "total_medical_bills": 5819.89,
        "total_expenses": 236.52,
        "total_liens": 32.83,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2023-11-07",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Connie-Goree-MVA-09-03-2024",
        "client_name": "Connie Goree",
        "case_summary": "Motor vehicle accident case for Connie Goree dated September 3, 2024, in Lexington, KY. Client and passenger Eric Wade (boyfriend) treated at Baptist Health ER. Client has ongoing back and leg pain, waiting for chiropractor appointment. Eric Wade already settled with Allstate for $1,500. Client's vehicle was total loss with property damage claim still unresolved. Insurance coverage through Allstate with two claims: BI claim #767778160 (adjuster Patrice Gaines) and PIP claim #768865107 (adjuster Mackenzie Betteridge). Police report obtained from Lexington PD via open records request. Letter of representation sent to Allstate December 2024. Major concern: Allstate has denied BI liability claim stating client was at fault. Have fee agreement, medical records from Baptist Health, police report, and various case documents on file. Bodycam footage no longer available per Lexington PD (destroyed after 60 days due to non-evidentiary status).",
        "current_status": "Case investigation phase. Allstate denied BI liability claiming client fault. PIP coverage confirmed but BI claim disputed. Awaiting strategy decision on liability dispute. Client has ongoing treatment needs with pending chiropractic care. Property damage claim remains unresolved. Need to review denial letter details and determine next steps for challenging liability determination.",
        "last_status_update": "2025-09-12T06:58:59.307581+00:00",
        "client_address": "1204 Moon Rise Way, Lexington, KY 40509",
        "client_phone": "859-300-9827",
        "client_email": "",
        "accident_date": "2024-09-03",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2024-12-05",
        "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Cora-Hall-WC-12-05-2022",
        "client_name": "Cora Hall",
        "case_summary": "CASE OVERVIEW:\nWorkers' Compensation claim for Cora Hall (now Payne) arising from workplace fall at Sonic Drive-In of Scottsville on 12/05/2022. Client suffered left wrist fracture requiring ORIF surgery (12/08/2022) and subsequent rotator cuff tear confirmed by MRI.\n\nINJURY & TREATMENT SUMMARY:\n- Primary: Left wrist fracture - surgically repaired at Medical Center Bowling Green ($37,188.55 paid by WC)\n- Secondary: Rotator cuff tear (MRI confirmed) and possible cervical spine involvement\n- Current ongoing treatment with multiple providers including Riverside Orthopedics, Riverside Vascular Surgery, Commonwealth Pain & Spine\n- Client paying out of pocket due to WC carrier denial of shoulder treatment\n\nLITIGATION STATUS:\n- Filed with KY Department of Workers Claims\n- Defense IME by Dr. Hazlewood found 2% whole person impairment but denied shoulder treatment necessity\n- Settlement offers rejected: $5,000 (Feb 2024), then $12,000 (Aug 2024)\n- BRC scheduled for March 5, 2025 at 10:15 AM EST\n- Active discovery and record requests ongoing through 2024/2025\n\nKEY CONTESTED ISSUES:\n- Relatedness of shoulder injury to workplace fall\n- Necessity of additional treatment for rotator cuff tear\n- Proper impairment rating and future medical benefits",
        "current_status": "ACTIVE LITIGATION - BRC set 03/05/2025. WC carrier (Accident Fund Insurance) denying shoulder treatment despite MRI-confirmed rotator cuff tear. Client experiencing financial hardship paying for treatment. Recent medical record requests sent to all providers (Dec 2024/Jan 2025). Defense represented by Tyler Hurst (Pohl Aubrey Gray). URGENT: Client contact overdue since last communication 06/13/2025 - need status update before BRC.",
        "last_status_update": "2025-09-12T07:00:46.259811+00:00",
        "client_address": "322 S. 7th Street, Scottsville, KY 42164",
        "client_phone": "(270) 943-1658",
        "client_email": "cmhgtle22@gmail.com",
        "accident_date": "2022-12-05",
        "total_medical_bills": 37188.55,
        "total_expenses": 1200,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2023-01-09",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Corey-Todd-MVA-WC-8-02-2025",
        "client_name": "Corey Todd",
        "case_summary": "Motor Vehicle Accident case for Corey Todd. Case created 9/5/25 and currently in file setup phase. No client intake information, insurance details, medical records, or accident documentation on file yet. Requires comprehensive client interview to gather all essential case information including accident details, injuries, medical treatment, insurance coverage, and complete contact information.",
        "current_status": "File Setup - Awaiting comprehensive client intake and information gathering",
        "last_status_update": null,
        "client_address": "107 N 44th St\nLouisville, KY 40212",
        "client_phone": "502-450-3826",
        "client_email": "unknown@unknown",
        "accident_date": "2025-08-02",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "09/05/2025 07:14 PM",
        "case_create_date": "2025-09-05",
        "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Cory-Stephenson-MVA-9-03-2025",
        "client_name": "Cory Stephenson",
        "case_summary": "MVA case involving Cory Stephenson (DOB: 8/16/98), who was t-boned at Newburg Road/West Buechel on 9/3/25 when other driver ran red light. Client sustained injuries to head, neck, back, left leg, right ankle, and left arm. Treated at UofL Hospital (emergency), transported by Louisville Metro EMS, currently treating at Starlite Chiropractic. Client was driving Enterprise rental car registered to Donisha Brock. State Farm has denied liability (claim #1789V463J, adjuster Cheryl Washington) claiming their insured had yellow light control. Medical records/bills not yet requested from any providers. No documents in file yet.",
        "current_status": "File setup complete. State Farm denied liability 9/5/25. Critical next steps: 1) Obtain police report to counter liability denial, 2) Request medical records/bills from all three providers (UofL Hospital, Louisville Metro EMS, Starlite Chiropractic), 3) Contact Enterprise for rental coverage details, 4) Set statute of limitations reminder for 9/3/27. Client continuing treatment at Starlite Chiropractic.",
        "last_status_update": "2025-09-12T07:01:25.34006+00:00",
        "client_address": "5017 Yaupon Lane\nLouisville, KY 40213",
        "client_phone": "502-303-6254",
        "client_email": "unknown@unknown",
        "accident_date": "2025-09-03",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "09/07/2025 10:36 AM",
        "case_create_date": "2025-09-06",
        "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Cynthia-Gibson-MVA-7-9-2025",
        "client_name": "Cynthia Gibson",
        "case_summary": "Motor vehicle accident case for Cynthia Gibson occurring July 9, 2025 on 65N in Bullitt County. Client was driving to pick up son in Louisville when Jose Navario (2012 Ford Focus) swerved from left lane into client's lane, losing control and spinning 180 degrees. Client lost control and went across all lanes into emergency lane. Transported by Bullitt County EMS to University of Louisville Hospital same day. Injuries include left hip injury, two bone abrasions on left arm requiring stitches on elbow, neck pain and entire left side pain. Currently treating at Starlite Chiropractic - 8/28/25 update shows leg PT ineffective due to pain, back stable, neck improving, new leg therapy starting 9/18/25. Three insurance claims: State Farm PIP (Ryan Ricci, 1787K940X), State Farm UM (Gary Jones, 1787Z112D), Root Auto BI (Courtney Heinnickel, BTQW3MKY) - all coverage pending investigation. Jose Navario not listed driver on Root policy (primary: John Walker). Medical records requested 7/15-7/16/25. EMS bill $1,556.80 paid. Police Report #25-001020. Extensive documentation includes injury photos, policy documents, medical authorizations. Statute of limitations: July 9, 2027.",
        "current_status": "Treatment Phase - Client actively treating at Starlite Chiropractic with mixed progress. Recent update (8/28/25): leg physical therapy not effective due to pain, back fine, neck improving but still tense, new leg therapy scheduled to begin 9/18/25. Three insurance companies have coverage investigations pending: State Farm PIP (Ryan Ricci), State Farm UM (Gary Jones), and Root BI (Courtney Heinnickel). Medical records requested from all providers on 7/15-7/16/25. EMS bill settled at $1,556.80. Wage verification form sent to client 7/17/25. Outstanding: case overview update due 8/29/25.",
        "last_status_update": "2025-09-12T07:04:07.018552+00:00",
        "client_address": "1105 N Buckman St, Apt A2, Shepherdsville, KY 40165",
        "client_phone": "502-921-6076",
        "client_email": "cyndiwilhite46@gmail.com",
        "accident_date": "2025-07-09",
        "total_medical_bills": 1556.8,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2025-07-10",
        "phase": "Treatment",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Dana-Jackson-MVA-1-24-2024",
        "client_name": "DJ",
        "case_summary": "Dana Jackson motor vehicle accident case from January 24, 2024. Co-plaintiff with Cecil Finley in lawsuit against defendant Justin Kiebler (Jefferson Circuit 24-CI-005774). Client treated at UofL Hospital emergency room on day of accident, then chiropractic care at Starlite through February 2024. Total medical bills $10,793 with $2,757 paid by PIP insurance (The General), leaving $8,036 outstanding. Two insurance companies involved: The General (PIP - confirmed coverage) and State Farm (BI - coverage pending). Discovery phase completed with responses filed. Client obtained $1,500 legal funding from LL Capital Strategies. No pleadings data found in the database.",
        "current_status": "Need to speak to client to reschedule depositions.  Awaiting deposition completion to proceed with settlement discussions. All medical treatment concluded, records obtained, and discovery responses filed. Outstanding medical bills totaling $8,036 await resolution. No pleadings data found in the database. Next action: Deposition preparation and attendance on July 9, 2025.",
        "last_status_update": "2025-09-12T21:10:09.635901+00:00",
        "client_address": "4906 Goddin Ct., Richmond, VA 23231",
        "client_phone": "804-855-8413",
        "client_email": "jdana8271@gmail.com, jacksondana950@gmail.com",
        "accident_date": "2024-01-24",
        "total_medical_bills": 10793,
        "total_expenses": 223.2,
        "total_liens": 607.41,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2024-02-06",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Daniel-W-Volk-MVA-09-24-2021",
        "client_name": "Daniel W. Volk",
        "case_summary": "Daniel W. Volk MVA 9/24/21: Client sustained neck/back injuries and post-accident headaches leading to discovery of meningioma requiring surgical removal. Litigation filed (Case No. 25-CI-00111, Oldham County) against Safeco Insurance. Key issue: Whether accident caused asymptomatic meningioma to become symptomatic. Total medical bills $173,693.85. Defense attorney William B. Orberson.",
        "current_status": "Active litigation in discovery phase. UIM negotiations ongoing with Safeco - current offer $28,500 vs $100,000 demand. Main dispute over meningioma causation. Past due action: Need meningioma expert to support causation theory (due 9/5/25). Defense has filed Answer and discovery requests. All insurance coverage confirmed.",
        "last_status_update": "2025-09-12T07:06:28.082302+00:00",
        "client_address": "7612 Willow Bend Dr, , Crestwood, ky 40014",
        "client_phone": "502-773-4262 Main",
        "client_email": "volkdan54@gmail.com",
        "accident_date": "2021-09-24",
        "total_medical_bills": 176094.94,
        "total_expenses": 0,
        "total_liens": 2452.3,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2021-12-15",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Davis-Robinson-SF-05-02-2025",
        "client_name": "Davis Robinson",
        "case_summary": "Davis Robinson slip-and-fall incident at Texas Roadhouse on 5/2/2025. Client stepped into a crevice in parking lot at 1940 Roschman Ave, Lima, OH, resulting in chipped left ankle that progressed to ruptured left quadriceps tendon requiring surgical repair on 5/15/2025. Initial treatment at Lima Memorial Hospital 5/2-5/3/2025. Client is now in post-surgical recovery phase and began weekly physical therapy in August 2025. Multiple medical providers involved including OrthoCincy for consultation, Orthopaedic Surgery Center for surgery, Seven Hills Anesthesia, and various radiology services. Medical bills paid/settled include Lima Memorial ($3,743), Lima Memorial Physicians ($7.07), Orthopaedic Surgery Center ($855.30), Seven Hills Anesthesia ($641.71), Radiology Associates of Northern Kentucky ($137.27), and Advanced Technology of Kentucky ($33.61). Total billed amounts approximately $15,950. Letter of representation sent to Texas Roadhouse 5/8/2025, acknowledged 5/9/2025. Claim #25-109767 assigned with adjuster Angela Milliner. Coverage status pending with Texas Roadhouse's bodily injury insurance.",
        "current_status": "Treatment phase - Post-surgical recovery. Client completed quadriceps tendon repair surgery 5/15/2025 and is attending weekly physical therapy as of August 2025. Most medical bills have been settled. Outstanding: Texas Roadhouse coverage determination pending, medical record requests pending from several providers, case overview update due 8/29/2025. Next action: Follow up on coverage determination with Texas Roadhouse adjuster Angela Milliner and complete outstanding medical record requests.",
        "last_status_update": "2025-09-12T01:40:38.078633+00:00",
        "client_address": "9861 Cherbourg Dr, Union, KY 41091",
        "client_phone": "502-541-1755",
        "client_email": "",
        "accident_date": "2025-05-02",
        "total_medical_bills": 15985.15,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2025-05-06",
        "phase": "Treatment",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Debra-Marshall-MVA-12-3-2022",
        "client_name": "Debra Marshall",
        "case_summary": "ACCIDENT: December 3, 2022 - Client Debra Marshall operating 50cc moped struck by defendant Jasmine Reed's vehicle on North Dixie Highway in Cave City, KY. Client sustained bilateral shoulder bruising and right thigh bruising requiring emergency transport by ambulance and helicopter.\n\nMEDICAL TREATMENT: Total medical bills $179,765+ from 10 providers including Cave City Fire Dept EMS, The Medical Center at Caverna, TriStar Skyline Medical Center, Air Evac EMS Prestonsburg, T.J. Health Pavilion, and multiple emergency physician groups. Most medical records collection incomplete.\n\nINSURANCE: Kentucky Farm Bureau (defendant's carrier, claim #4778044, adjuster Jason Osboe) DENIED both bodily injury liability and PIP coverage. BI denied due to alleged client fault. PIP denied because 50cc moped doesn't qualify for pedestrian coverage.\n\nLITIGATION STATUS: \n- Circuit Court Case: Barren Circuit 23-CI-00659 (Debra Marshall v. Jasmine Reed)\n- District Court Case: Barren District 23-C-01110 (KFBMIC a/s/o Edie Renick v. Debra Marshall) \n- Cases consolidated per 1/23/2024 Order\n- Defense counsel: Patrick Ross (Hensley & Ross) representing Jasmine Reed\n- Aaron Whaley took over case from Bryce Koon in 2024\n- Depositions scheduled and completed March 3, 2025 (Client 10:30a, Defendant 1:30p via Zoom)\n\nCURRENT STATUS: Post-deposition phase. Awaiting 30-day review period for settlement discussions or additional discovery. Client contacted multiple times for updates through friend Anna Datillo(270-943-1597). Next action pending attorney review of deposition testimony.",
        "current_status": "Depositions Completed - Discovery/Settlement Phase ",
        "last_status_update": "2025-09-12T07:06:01.71341+00:00",
        "client_address": "1224 N Dixie Hwy #1, Cave City, KY 42127",
        "client_phone": "(364) 276-1738 Personal Mobile",
        "client_email": "",
        "accident_date": "2022-12-03",
        "total_medical_bills": 179766.37,
        "total_expenses": 582.77,
        "total_liens": 12472.85,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2022-12-30",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Destiny-Adkins-MVA-04-16-2021",
        "client_name": "Destiny Adkins",
        "case_summary": "Motor vehicle accident case involving Destiny Adkins and Juanita Nicole Downs vs. Stephanie M. Nail, Demetrius Turner (substituted defendant), and Allstate Insurance. Filed in Jefferson Circuit Court (22-CI-002878) on June 8, 2022, before Judge Eric J. Haner. Key facts: Vehicle was reported stolen AFTER accident (not before as initially stated in police report), causing Allstate to initially deny coverage. Bad faith claim against Allstate was bifurcated and placed in abeyance pending resolution of main liability case. Total medical bills approximately $20,027.91 from University of Louisville Hospital system. Active litigation phase with ongoing discovery and deposition scheduling.",
        "current_status": "URGENT: Motion for summary judgment response overdue since 2025-08-26. Two summary judgment motions filed by defense (Turner on 8/28, Allstate on 9/3) with responses due 9/17 and 9/22. Deposition scheduling for Turner ongoing with defense counsel (Rice Gumm PLLC). Case in active discovery phase with ongoing disputes - Turner's discovery responses 60+ days overdue as of 11/01/2024. FILE ORGANIZATION: 284 files organized into 8-bucket system (86% complete), 39 files remain in root for manual review. Turner has been difficult to locate (MIA per defense counsel 11/04/2024). Vehicle was reported stolen AFTER accident, causing initial Allstate coverage denial. Bad faith claim bifurcated and in abeyance pending main liability resolution.",
        "last_status_update": "2025-11-30T21:45:00.000000+00:00",
        "client_address": "11322 Hayes Landing Road #204, , Louisville, KY 40299",
        "client_phone": "502-931-1711 Main",
        "client_email": "destinyadkins0409@yahoo.com",
        "accident_date": "2021-04-16",
        "total_medical_bills": 20027.91,
        "total_expenses": 499.08,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2022-02-03",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Dewayne-Ward-MVA-8-29-2023",
        "client_name": "Dewayne Ward",
        "case_summary": "Motor vehicle accident case involving Dewayne Ward (driver), Ashlee Williams and Julmonzhae Moore (passengers) occurring 8/29/2023 in New Albany, Indiana. Client cited for failure to yield right-of-way during left turn, claims he had green arrow. Police report #2023-00047347 obtained with 12 scene photos from New Albany PD body cameras. Client sustained back/spine injuries requiring chiropractic treatment at Starlite Chiropractic ($12,130 in bills, 24 visits from 08/30/2023-10/30/2023). Emergency treatment at University of Louisville Hospital post-accident, radiology findings noted as \"not related.\" Liberty Mutual PIP benefits paid $9,395 of $10,235 billed, exhausted 10/31/2023. Elco Insurance initially identified as defendant's coverage but denied - rental company did not add coverage, defendant has State Farm policy. Multiple settlement demands to State Farm denied: (1) 83-page demand 12/1/2023 for $74,146, (2) 3-page demand 10/22/2024 for $30k (Ward), $50k (Williams), $50k (Moore). State Farm denied liability 12/14/2023 and 10/25/2024. Lawsuit filed 1/29/2025 in Floyd Circuit Court as Williams, Ward & Moore v. Robinson (Case #Floyd 22D03-2501-CT-000157). Witness Ruth Corbett statements (text 9/29/2023 and audio 11/1/2024) support client's claim of green arrow. Comprehensive file organization completed 11/30/2025 - all 139 case files now organized in 8-bucket system with standardized naming.",
        "current_status": "Active litigation in Floyd Circuit Court. Discovery phase ongoing - Plaintiffs completed discovery responses and document production 7/28/2025 via Dropbox link to defense counsel. Dewayne Ward's Answers to Interrogatories filed 7/23/2025. Plaintiff's First Set of Interrogatories to Defendant filed 1/29/2025. Defense counsel's responses pending. All medical records obtained: AmeriPro EMS (no patient found per ChartSwap), University of Louisville Hospital (radiology not accident-related), Starlite Chiropractic (complete records and billing received - 38 treatment notes plus final bill). Client last contacted office 1/13/2025 via voicemail checking status. File organization completed 11/30/2025 with 99% quality score - case files now fully organized and ready for trial preparation. Multi-party case properly separated with only Dewayne Ward documents in this folder.",
        "last_status_update": "2025-11-30T21:40:00.000000+00:00",
        "client_address": "3429 Cathe Dykstra Way, Louisville, KY 40216",
        "client_phone": "502-356-7572",
        "client_email": "dewayneward5@gmail.com",
        "accident_date": "2023-08-29",
        "total_medical_bills": 12130,
        "total_expenses": 79.85,
        "total_liens": 0,
        "case_last_activity": "11/30/2025 09:40 PM",
        "case_create_date": "2023-08-30",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Douglas-Livers-MVA-1-19-2023",
        "client_name": "Douglas G. Livers",
        "case_summary": "On January 19, 2023, Plaintiff Douglas G. Livers was traveling westbound on Fern Creek Road in Louisville, Kentucky, when his Chevrolet Silverado was struck in the rear passenger side by a Chevrolet Malibu operated by Daetoia Lewis. According to the Louisville Metro Police Department Collision Report, Lewis was traveling southbound on Ferndale Road on her way to work, following GPS directions, and entered the intersection without noticing Livers' vehicle until it was too late. Lewis admitted she was unfamiliar with the area and was looking at her GPS when she entered the intersection and struck Livers' truck. Both vehicles sustained moderate damage and were towed from the scene.\n\nINJURIES & TREATMENT: Livers suffered left shoulder pain and left foot pain. He initially treated at Dixie Injury & Rehab from 1/26/2023 to 1/30/2023 (2 visits, $1,215 billed). Primary ongoing treatment has been at Aptiva Health starting 12/6/2023 ($16,020 billed, $2,235 settlement payment received). Medical imaging includes X-rays and MRIs of shoulder and foot taken 12/6/2023 and 12/13/2023.\n\nINSURANCE: Client's Allstate UM/UIM coverage ($50k/$100k, R. Kellams policy, claim #700228547, adjuster Thomas Blizzard). UM demand sent 11/28/2023 for $12,500, current offer $750. Allstate PIP coverage confirmed with over $15k paid (adjuster Amanda). Root Auto Insurance BI coverage denied (claim #QMJF78KY, proper policy C6LJQR).\n\nLIENS: Child support lien of $46,260.51 as of 8/2/2024 (originally $37,000) being disputed. Workers' compensation claim being pursued for shoulder injury.\n\nLITIGATION: Case filed as Livers v. Allstate Property and Casualty Insurance, Jefferson Circuit Court 24-CI-004424. Defense counsel: Valerie Herbert, TRAVIS, HERBERT & STEMPIEN ATTORNEYS. Client deposition completed 2/12/2025.",
        "current_status": "Post-deposition phase with ongoing mediation scheduling delays. Defense counsel (Valerie Herbert) has indicated adjuster turnover issues and coverage questions regarding work vehicle use on personal policy. Last communication 7/25/2025 indicated adjuster reviewing policy exclusions. Outstanding overdue follow-up with defense counsel required (due 9/5/2025). Client expressed frustration with communication delays via text 6/30/2025. Awaiting defense response on mediation scheduling or settlement offer. Workers' compensation claim being pursued in parallel.",
        "last_status_update": "2025-09-12T07:11:58.745685+00:00",
        "client_address": "9510 Rustling Tree Way #202, Louisville, KY 40291",
        "client_phone": "502-558-8900",
        "client_email": "douglivers@gmail.com",
        "accident_date": "2023-01-19",
        "total_medical_bills": 17235,
        "total_expenses": 310.11,
        "total_liens": 48495.51,
        "case_last_activity": "11/30/2025 09:50 PM",
        "case_create_date": "2023-11-10",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Dustin-Meade-MVA-03-09-2025",
        "client_name": "Dustin Meade",
        "case_summary": "Motor vehicle accident case for Dustin Meade involving hit-and-run collision on 3/9/2025 in Jeffersonville, IN. Client sustained lower back pain, right hip pain, and right foot numbness. Treated at Scott County Chiropractic (3/20/2025-7/17/2025) and had lumbar spine MRI at 1st Diagnostics (4/10/2025). Lost wages of 16 hours at $50/hour were paid by PIP. Medical records obtained from both providers. Demand package prepared on 8/8/2025. Progressive Insurance Co. provides both PIP and UM coverage under claim #25-615241502. PIP adjuster: Katie Mills (502-909-3687), UM adjuster: Kara Hoskins. Total medical bills: Scott County Chiro paid $466.84, 1st Diagnostics billed $1,950 with $211.44 settlement payment made.",
        "current_status": "Demand package sent to Progressive UM on 8/8/2025. Awaiting response from UM adjuster Kara Hoskins regarding settlement negotiations. All medical treatment completed as of 7/17/2025. All medical records and bills obtained. Case ready for settlement discussions. Next action: Follow up on demand response and negotiate settlement terms.",
        "last_status_update": "2025-09-12T07:11:42.499816+00:00",
        "client_address": "512 Mabel Lane, Scottsburg, IN 47170",
        "client_phone": "502-799-3729",
        "client_email": "dustinmeade87@gmail.com",
        "accident_date": "2025-03-09",
        "total_medical_bills": 1950,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2025-03-19",
        "phase": "Settlement",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Elizabeth-Lindsey-MVA-12-01-2024",
        "client_name": "Elizabeth Lindsey",
        "case_summary": "Elizabeth Lindsey MVA case from December 1, 2024. Family collision handled by Boone County Sheriff involving Elizabeth, husband Jeremy, and children Chase and Owen. Elizabeth sustained left shoulder pain, chest pain, and left shoulder tightness. Treated at UC Medical Center (ER 12/1/24, billed $12,990.37), Aptiva Health (physical therapy 12/13/24-1/14/25), St. Elizabeth Physicians-Burlington, UC Physicians, and Radiology Associates of Northern KY. Three insurance coverages: Auto Owners PIP (claim 300-793616-2024, adj: Chandler Wolfe), Progressive BI (claim 24-902741838, adj: Jennifer Howard), and Auto Owners UIM (claim 300-793616-2024, adj: Emily Pernice). UIM exposures opened for all four family members. BI demand sent to Progressive 1/21/25, response received 2/6/25. Treatment completed April 2025. Medical records and bills requested from multiple providers. PIP ledgers requested 4/21/25.",
        "current_status": "Case in settlement phase. Treatment completed April 2025. BI demand sent to Progressive 1/21/25 with response received 2/6/25. UIM exposures opened for Elizabeth, Jeremy, Chase, and Owen with Coots notice process ongoing. PIP coverage active with Auto Owners (adj: Chandler Wolfe) - client contacted adjuster directly 3/27/25 about medical bills. Medical record requests sent to multiple providers. Outstanding tasks: complete data entry for medical providers with treatment dates and billing amounts, follow up on PIP ledgers requested 4/21/25, finalize settlement negotiations. Case phase: Demand in Progress.",
        "last_status_update": "2025-09-12T07:12:01.822013+00:00",
        "client_address": "1233 Citation Dr, Union, KY 41091",
        "client_phone": "502-210-8328",
        "client_email": "elindsey611@gmail.com",
        "accident_date": "2024-12-01",
        "total_medical_bills": 12990.37,
        "total_expenses": 72.01,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2024-12-03",
        "phase": "Demand in Progress",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Estate-of-Betty-Prince-Premise-7-14-2020",
        "client_name": "Robert Prince",
        "case_summary": "PREMISES LIABILITY CASE: Estate of Betty Prince vs. Norton Hospitals, Inc.\n\nINCIDENT: July 14, 2020 - Premise liability incident occurred at Norton Hospital premises. Betty Prince was hospitalized from 7/14/20-7/29/20 at Norton Hospital Downtown, followed by home health care with Kindred at Home from 7/23/20-3/29/21.\n\nCASE STATUS: Active litigation filed 7/1/2021. Discovery phase ongoing with multiple pleadings filed including Motion to Compel (granted 5/20/2024). Depositions being conducted including nursing staff. Recent deposition scheduling activity for Donna Jones confirmed for May 6, 2025.\n\nMEDICAL PROVIDERS: Total bills $44,533.90. Kindred at Home paid ($19,484.81). Outstanding bills: Norton Hospital ($23,396.09), Southern Emergency Medical Specialists ($1,225), Diagnostic Imaging Alliance ($428). Medical records still needed from Norton, Southern Emergency, and Diagnostic Imaging.\n\nINSURANCE: Coverage confirmed but missing critical details - insurance carrier name, claim number, adjuster information for Norton Hospital's liability insurance.\n\nPRIORITY ITEMS: (1) CRITICAL OVERDUE: Reach out to defense counsel to discuss demand (due 9/5/25 - now 7 days overdue as of 9/12/25), (2) Obtain Norton Hospital's insurance information, (3) Request outstanding medical records from 3 providers.",
        "current_status": "Discovery phase ongoing - Motion to compel granted 5/20/24, depositions scheduled (Donna Jones 5/6/25), CRITICAL: Defense counsel contact 7 days overdue",
        "last_status_update": "2025-09-12T07:12:34.159024+00:00",
        "client_address": "1249 Race Track Road, , Milton, KY 40045",
        "client_phone": "502-525-7492 Main",
        "client_email": "",
        "accident_date": "2020-07-14",
        "total_medical_bills": 44533.9,
        "total_expenses": 491.01,
        "total_liens": 5887.97,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2021-12-15",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Estate-of-Evangeline-Young-MVA-8-12-2023",
        "client_name": "Evangeline Young",
        "case_summary": "Fatal motor vehicle accident case involving Evangeline Young who died on 8/17/23 from injuries sustained in 8/12/23 collision in Louisville, KY. Multiple defendants including police officer Jacob Ray and Derby City Gaming LLC. BAC level of 0.22 documented. University of Louisville Hospital bill of $234,932.10 has been settled. Active litigation in Jefferson Circuit Court (24-CI-003826) with ongoing discovery disputes and Motion to Compel filed.",
        "current_status": "Motion to Compel scheduled for January 6, 2025 regarding outstanding defendant discovery responses. Dwight Young (administrator) deposition scheduled May 30, 2025. Awaiting defendant responses to discovery requests. Metro Government dismissed via sovereign immunity. Active discovery phase with multiple defendants remaining.",
        "last_status_update": "2025-09-12T07:15:27.492764+00:00",
        "client_address": "8506 Gregory Way, Louisville, KY 40219",
        "client_phone": "502-224-7146",
        "client_email": "dwightlamaryoung@gmail.com",
        "accident_date": "2023-08-12",
        "total_medical_bills": 236347.9,
        "total_expenses": 720.81,
        "total_liens": 89212.31,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2023-09-12",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Faizon-Procter-Witcher-MVA-7-01-2025",
        "client_name": "Faizon Procter-Witcher",
        "case_summary": "Faizon Procter-Witcher motor vehicle accident case from July 1, 2025. Client treated at St. Mary's Hospital ER on date of accident (also has prior assault-related visit 4/5/2025 in same records), received ongoing treatment at Starlite Chiropractic and UofL Health - Mary & Elizabeth Hospital. Direct Auto Insurance claim #250531476 established for both Bodily Injury and Personal Injury Protection coverage. Letters of representation sent July 3, 2025 to both BI and PIP departments. PIP acknowledgment received July 15, 2025 with declaration page, assigned to adjuster Darria Thomas. Settlement demand package sent to Direct Auto BI adjuster (confirmed received and under review per 11/5/2025). Case files fully organized into standardized 8-bucket system as of 11/30/2025. Key documents on file include signed intake forms, HIPAA authorization, police report, Kentucky No-Fault application, representation letters, medical records from both providers, and settlement demand package. Outstanding: itemized medical bills from UofL Health (3rd request sent 10/29/2025, 30-day processing time) and EMS bills from Pleasure Ridge Park. Client contact information: 502-450-3149, 3412 Cathy Dykstra Way Apt 204, Louisville KY 40216.",
        "current_status": "Negotiation/Settlement phase. Demand package under review by Direct Auto BI adjuster. Awaiting: (1) itemized medical bills from UofL Health (requested 10/29/2025, 30-day processing expected), (2) EMS bills from Pleasure Ridge Park, (3) response to settlement demand from Direct Auto. Case files fully organized and ready for settlement negotiations. Client has called multiple times (most recent 11/6/2025 and 11/7/2025) - follow-up needed. Next actions: Follow up on outstanding medical bills, monitor demand response timeline, update client on settlement status.",
        "last_status_update": "2025-11-30T22:15:00.000000+00:00",
        "client_address": "3412 Cathey Dykstra Way, Apt 204, Louisville, KY 40216",
        "client_phone": "502-450-3149",
        "client_email": "",
        "accident_date": "2025-07-01",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/30/2025 10:15 PM",
        "case_create_date": "2025-07-03",
        "phase": "Negotiation Settlement",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Fidel-Antonio-Bueso-Sandoval-MVA-06-13-2024",
        "client_name": "Fidel Antonio Bueso Sandoval",
        "case_summary": "Multi-claimant motor vehicle accident case with 10 total injured parties from June 13, 2024. Client (Fidel Antonio Bueso Sandoval) is Spanish-speaking requiring Google Translate communication. Received emergency room treatment only at University of Louisville Hospital on accident date. Total medical expenses $20,718.50 including EMS transport ($1,118.20), hospital treatment ($19,061.30), radiology services ($539.00), with ER physician bill pending. All medical bills settled through State Farm PIP coverage. Police report obtained with photos on file. Client confirmed no ongoing treatment as of last contact 2/19/2025. Case involves limited State Farm BI coverage with only $25k per person/$50k total limits shared among all 10 claimants.",
        "current_status": "Global settlement negotiations ongoing with State Farm BI adjuster Abigail Jett. Demand package sent 2/19/2025 with complete medical records and bills. Settlement offer of $12,000 received as part of global resolution for all 10 claimants. Coordinating with other attorneys (Scott Justice, Murphy & Associates) representing remaining injured parties. Challenge: Limited BI coverage ($50k total for 10 claimants) vs. $20k+ medical expenses per claimant. PIP paylog current through 2/27/2025. Next action: Monitor adjuster response and coordinate final settlement negotiations with co-counsel for optimal distribution of limited coverage.",
        "last_status_update": "2025-09-12T07:17:15.298672+00:00",
        "client_address": "3206 Wessel Rd, Louisville, KY 40216",
        "client_phone": "502-550-2983",
        "client_email": "",
        "accident_date": "2024-06-13",
        "total_medical_bills": 20718.5,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2024-06-18",
        "phase": "Negotiation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Fina-Fatty-MVA-11-05-2024",
        "client_name": "Fina Fatty",
        "case_summary": "Motor vehicle accident case - rear-end collision in Ohio on 11/5/2024. Client Fina Fatty was rear-ended by FedEx vehicle. Treated at St. Joseph East emergency room on 11/6/2024, single visit with total bills of $7,135 (no write-offs). Treatment completed same day. Progressive PIP coverage available but no bills paid yet. Liberty Mutual BI coverage confirmed. Demand sent 5/19/2025 for $25,000, currently negotiating with Liberty Mutual adjuster Sarah Mackay. Current offer $1,000, requested $12,000 counter. Last communication July 2025. Ohio case follows Robinson v. Bates standard. Police report obtained. Medical records from St. Joseph East received. All necessary documentation in file.",
        "current_status": "Active negotiation with Liberty Mutual BI adjuster. Demanded $25k, countered at $12k, current offer $1k. Awaiting response to our follow-up regarding their usual/customary review rationale. PIP claim with Progressive - no payments made yet, adjuster Terry Woodring assigned. Need to follow up on PIP payments and continue BI negotiations.",
        "last_status_update": "2025-09-12T01:45:30.597989+00:00",
        "client_address": "",
        "client_phone": "859-202-7110",
        "client_email": "fattypa249@gmail.com",
        "accident_date": "2024-11-05",
        "total_medical_bills": 7135,
        "total_expenses": 60,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2025-01-13",
        "phase": "Negotiation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Forrest-Muss-MVA-07-20-2025",
        "client_name": "Forrest Muss",
        "case_summary": "Coffee spill burn incident at McDonald's on 7/20/2025. Client treated at Little Clinic same day for thigh burn, medical bills ($99) settled. Fee agreement signed 7/22/2025. Seven burn photos, medical records, receipts, and McDonald's grill slip documented. North American Risk Services claim #136751083 established, coverage confirmation pending. Client's DOB and SSN still needed.",
        "current_status": "File organization completed 11/30/2025 - all case files properly organized into 8-bucket system with standardized naming. Awaiting insurance coverage confirmation from North American Risk Services (claim #136751083). Medical treatment completed at Little Clinic (PA Tejah Strickland) and bills settled ($99 paid). Case documentation complete except for missing client DOB/SSN. Statute of limitations: 7/20/2026 (1 year from incident).",
        "last_status_update": "2025-11-30T22:15:00+00:00",
        "client_address": "",
        "client_phone": "502-432-9130",
        "client_email": "",
        "accident_date": "2025-07-20",
        "total_medical_bills": 99,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/30/2025 10:15 PM",
        "case_create_date": "2025-07-22",
        "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Frances-Whitis-WC-MVA-9-6-2024",
        "client_name": "Frances Whitis",
        "case_summary": "On September 6, 2024, Frances Whitis was driving a Kia taxi for Bluegrass Taxi northbound on US 421 in Frankfort, Kentucky when she looked down to answer her phone and struck a guardrail at 45-50 mph. She sustained fractured sternum, rib fractures, and blood clots (now resolved). \n\nMEDICAL TREATMENT: Frankfort Regional Medical Center ($31,414.07 paid), Family Care of Bluegrass-East ($858.00 paid), Frankfort EMS (transport).\n\nINSURANCE STATUS: Progressive PIP confirmed and benefits paid (claim #24-727042794, adjuster Amanda Clemons). Workers' compensation coverage disputed - employer Bluegrass Taxi uninsured, UEF joined as defendant in WC claim (KY DWC 2024-01285).\n\nLITIGATION STATUS: Discovery phase active - RFPDs served and responses received. Defense alleging Frances was intoxicated and was independent contractor, not employee. Medical records filed with court. Medicare and Aetna Medicare liens pending final amounts.\n\nIMMEDIATE PRIORITIES: Schedule overdue defendant deposition (due 9/5/25). Aaron Whaley now primary attorney after Bryce Koon's departure.",
        "current_status": "OVERDUE: Defendant deposition scheduling (due 9/5/25). Discovery active, liens pending (Medicare/Aetna). WC claim with UEF as defendant, PIP benefits paid. Defense alleging intoxication/independent contractor status.",
        "last_status_update": "2025-09-15T07:22:54.773574+00:00",
        "client_address": "117 Redbud Lane, Frankfort, KY 40601",
        "client_phone": "502-330-2363",
        "client_email": "whitisfrances1@gmail.com",
        "accident_date": "2024-09-06",
        "total_medical_bills": 32272.07,
        "total_expenses": 30,
        "total_liens": 0,
        "case_last_activity": "11/30/2025 11:30 PM",
        "case_create_date": "2024-09-13",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Greg-Neltner-MVA-4-1-2023",
        "client_name": "Greg Neltner",
        "case_summary": "On April 1, 2023, Greg Neltner and his companion passenger, Cecelia Neltner, were involved in a motor vehicle collision on KY 18 in Florence, Kentucky. The defendant, Trinity Cohara, cut across three lanes of traffic to turn in front of their vehicle, leaving no time to avoid collision. Police Report #23004505 confirms the defendant's liability.\n\nGreg sustained neck and back injuries and received chiropractic treatment at Southgate Chiropractic & Massage Wellness Center from April 12, 2023 to August 21, 2023 (36 visits, $8,605 billed). He also has records from St. Elizabeth Physicians Primary Care (records received 3/17/25).\n\nProgressive Insurance Company (BI claim #23-6275504, adjuster Amy Morris) initially denied liability but mediation was held July 8, 2025, which failed. Their last offer was $1,500 (1/22/25) against our $25,000 demand. State Farm PIP (claim #1747Q474T) paid $4,980 in medical bills.\n\nThis is now the lawsuit Neltner v. Cohara with depositions completed in September 2024. Defense counsel is Richardson Law Group (Katie Nelson Dunn, Josh Leckrone, Whitney Moore). Case is proceeding to trial post-mediation.",
        "current_status": "Post-mediation phase with case proceeding to trial. Discovery completed including depositions of both plaintiffs (September 2024). Defense's mediation offer of $1,500 for Greg and $1,000 for Cecelia was rejected. Two overdue to-dos need attention: case overview update (due 8/29/25) and request for updated records from OrthoCincy (due 8/27/25). Medical records compilation appears complete from primary providers.",
        "last_status_update": "2025-09-12T07:21:10.003915+00:00",
        "client_address": "317 W 13th St, Newport, KY 41071",
        "client_phone": "859-433-1385",
        "client_email": "neltnergreg@gmail.com",
        "accident_date": "2023-04-01",
        "total_medical_bills": 8605,
        "total_expenses": 319.83,
        "total_liens": 4980,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2023-04-28",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Henrietta-Jenkins-MVA-5-20-2025",
        "client_name": "Henrietta Jenkins",
        "case_summary": "Henrietta Jenkins MVA case from 5/20/2025. Client was rear-ended after leaving our office and pushed into vehicle in front of her. Police report obtained (LMPD #25057018, Badge 4693). Injuries: concussion and left side pain near ribs. Emergency treatment at Norton Audubon Hospital ($9,949.10 bill paid). Ongoing treatment at Synergy Injury Care & Rehab Diagnostics with MRI scans of cervical and lumbar spine completed 7/15/2025. Progressive BI insurance claim #25-391686743 - liability investigation pending, adjuster Selena Kelly. Root PIP claim #HH62DDIN confirmed coverage, adjuster Kaisha Reese. Property damage vehicle repaired through Progressive at Montgomery Collision. Client received multiple financial assistance loans during treatment. Vehicle financing fell through, dealership took possession. Client lives in Indiana with mother. Letters of representation sent to both insurers and acknowledged. 36 documents on file including police reports, medical records, MRI results, insurance correspondence, and intake forms. Next action: Obtain final records and bills from Synergy to prepare for settlement. Statute of limitations: 5/20/2027.",
        "current_status": "Treatment Complete - Awaiting Final Medical Records from Synergy for Settlement Preparation. Case files reorganized into proper 8-bucket structure on 1/15/2025.",
        "last_status_update": "2025-01-15T14:30:00.000000+00:00",
        "client_address": "3508 Fern Lea Rd, #21, Louisville, KY 40216",
        "client_phone": "(502) 804-8022 Personal Mobile",
        "client_email": "henriettaj23@gmail.com",
        "accident_date": "2025-05-20",
        "total_medical_bills": 9949.1,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "01/15/2025 02:30 PM",
        "case_create_date": "2025-05-21",
        "phase": "Treatment",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Hope-Renee-Padgett-MVA-1-16-2023",
        "client_name": "Hope Renee Padgett",
        "case_summary": "1/16/23 MVA - T-bone collision at 4-way intersection in Stanton, KY (rainy/wet conditions). Client knocked unconscious, airbag burns, head injury, left knee injury. KFB BI settled for $25k policy limits (1/2/24). Progressive PIP exhausted ($10k paid of $32k billed, closed 9/15/23). UIM litigation filed 12/22/23 in Powell Circuit Court #25-CI-00044, summons served 3/11/25. Medical treatment: Clark Regional ER (1/17/23), 11-month gap, Linton Spine chiropractic (12/21/23-3/15/24), CHI St Joseph imaging (3/15/24 - MRI brain/spine), Sterling Healthcare ongoing. Total medical bills $43,362.09. Optum lien $1,066. Medicare no conditional payments. ALERT: At-fault driver filed small claims case AGAINST client (2/21/23). Outstanding: Baptist Neurology records (unable to locate per 8/20/24), PIP ledger. Case files fully organized 11/30/25 (165 files, 8-bucket system).",
        "current_status": "UIM litigation active (Powell Circuit #25-CI-00044). KFB BI settled $25k (1/2/24). Progressive PIP exhausted. Optum lien $1,066. 11-month treatment gap may impact case value. Small claims defense needed (Barnes v. Padgett). Case files reorganized and ready for litigation prep. Outstanding: Baptist Neurology records, PIP ledger.",
        "last_status_update": "2025-11-30T23:55:00.000000+00:00",
        "client_address": "2112 Robin Ln, , Mount Sterling, KY 40353",
        "client_phone": "(859) 585-3450 Personal Mobile",
        "client_email": "hrteegarden1966@gmail.com",
        "accident_date": "2023-01-16",
        "total_medical_bills": 43362.09,
        "total_expenses": 418.31,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2023-01-24",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Jacob-Herrle-MVA-6-17-2025",
        "client_name": "Jacob Herrle",
        "case_summary": "Jacob Herrle MVA case from 6/17/2025 on Highway 17 at Highland Pike/Orphanage Road intersection. Bus attempted illegal U-turn causing sideswipe collision. Client has pre-existing conditions: arthritis in spine, cervical fusion (5 surgeries past 4 years), previous lower back surgery, plus new right hip injury from accident. Treated at St. Elizabeth Edgewood Hospital ER and UC Gardner Neuroscience Institute (ongoing neurosurgery consultation). Insurance: State Farm PIP (claim 1786K421P, Anne Perez contact) and Collins & Company BI (claim 733249, Jim Johnson adjuster). Both LORs sent and acknowledged. PIP ledger received 7/10/25. Client scheduled for hip MRI and provided 5-year medical history USB (password: 11251992) received 7/30/25. Police report obtained. Key documents: intake forms, police reports, insurance correspondence, health insurance cards (Anthem), acknowledgment letters. Statute of limitations: 6/17/2027.",
        "current_status": "Currently in Treatment phase. Client undergoing ongoing neurosurgery consultation at UC Gardner while scheduling hip MRI. Medical records and bills requested from St. Elizabeth Edgewood Hospital on 7/7/25 but not yet received - follow-up needed. Records/bills from UC Gardner not yet requested. Case overview update task overdue since 8/29/25. Need to: 1) Follow up on St. Elizabeth records/bills, 2) Request UC Gardner records/bills, 3) Confirm MRI facility once client provides info, 4) Monitor treatment progress, 5) Maintain regular client contact (last documented contact 7/30/25). **UPDATE 11/30/25:** Case file organization completed - all documents organized into 8-bucket system with standardized naming, 8 duplicate sets removed, 100% naming compliance achieved.",
        "last_status_update": "2025-11-30T23:30:00.000000+00:00",
        "client_address": "3032 Alderbrook Dr, Independence, KY 41051",
        "client_phone": "859-547-2611",
        "client_email": "jherrle44@gmail.com",
        "accident_date": "2025-06-17",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2025-07-02",
        "phase": "Treatment",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Jae-Kale-Lewis-MVA-02-24-2025",
        "client_name": "Jae-Kale Lewis",
        "case_summary": "Motor vehicle accident on 2/24/2025 in Louisville, KY involving client Jae-Kale Lewis (and Shaylynn). Client sustained neck and back injuries, treated at UofL Health Mary & Elizabeth Hospital ER same day, then 8 visits at Starlite Chiropractic from 3/4/2025 to 4/22/2025. Uninsured motorist involved - State Farm UM claim opened under policy 1780Z939M with adjuster Steve Campbell. Demand for $25,000 sent 6/30/2025, initial offer $2,500 on 7/22/2025, settled for $5,000 on 7/28/2025. Medical expenses: Southeastern Emergency Services $730, UofL Health $1,180, Starlite Chiropractic $3,200 (total $5,110 billed, $5,014 paid). All records obtained, all bills settled. Police report available. Lost wages addressed with wage verification form.",
        "current_status": "SETTLED - UM claim resolved for $5,000 on 7/28/2025. All medical bills ($5,014) paid from settlement. Case closed.",
        "last_status_update": "2025-09-12T07:25:03.001993+00:00",
        "client_address": "607 Alger Ave,  ",
        "client_phone": "502-755-1288",
        "client_email": "jaekale2005@gmail.com",
        "accident_date": "2025-02-24",
        "total_medical_bills": 5110,
        "total_expenses": 30,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2025-02-25",
        "phase": "Settlement",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "James-Crowdus-MVA-8-10-2025",
        "client_name": "James Crowdus",
        "case_summary": "Motor vehicle accident case for 20-year-old James Crowdus. Accident occurred 8/10/2025 at 25th and Hill, Louisville. Client was driving grandmother's vehicle (owner: Vicky Henley) when struck. Transported via EMS to Norton Hospital with injuries to neck, left shoulder, and lower back. Client treated with 5 providers: Louisville Metro EMS, Norton Hospital, Aptiva Health, Starlite Chiropractic, and Diagnostic Imaging Alliance. State Farm coverage for both PIP (17-88V4-53C) and BI (17-88T6-48L) with adjuster Leslie Simon. Letters of representation sent 8/14/2025 and acknowledged 8/15/2025. Police report obtained (LMPD #25093424). Property damage being handled under at-fault driver's liability coverage. Client completed treatment and case moved to Demand in Progress phase on 10/23/2025.",
        "current_status": "Case in Demand in Progress phase (as of 10/23/2025). Client completed treatment. Medical records requested from all providers (10/29-10/30/2025). Most recent PIP ledger received 11/19/2025. File organization completed 11/30/2025 - all 83 files organized into 8-bucket system with standardized naming. Disengagement letter image found - may require status verification. Statute of limitations: 8/10/2027.",
        "last_status_update": "2025-11-30T23:53:00.00000+00:00",
        "client_address": "2909 Narragansett Dr\nLouisville, KY 40210",
        "client_phone": "502-322-7896",
        "client_email": "unknown@unknown",
        "accident_date": "2025-08-10",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/30/2025 11:53 PM",
        "case_create_date": "2025-09-05",
        "phase": "Demand in Progress",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "James-Kiper-MVA-12-5-2022",
        "client_name": "James Kiper",
        "case_summary": "James Kiper v. Musimbi Amani (Jefferson Circuit Court 23-CI-005758)\n\nMotor vehicle collision on 12/5/2022 with spinal injuries (L3-4, L4-5, L5-S1 disc herniation and nerve impingement). Client treated at 5 medical facilities with total bills of $18,325.25.\n\nKEY CHALLENGES:\n- Low-speed impact per EDR challenging medical causation\n- Travelers UM offering only $500 against $100k demand\n- Ongoing discovery disputes regarding EDR information since Oct 2024\n- PIP exhausted with $4k escrow for liens ($687.54 Conduent lien outstanding)\n\nLITIGATION STATUS: Case filed Sept 2023. Defendant served Jan 2024. Defense counsel substituted from Kopka Pinkus Dolin to Sewell & Neal (Feb 2025). Ready to mediate but discovery issues persist.",
        "current_status": "Discovery disputes ongoing - awaiting EDR responses before mediation. Case files reorganized to 8-bucket system (12/1/2025).",
        "last_status_update": "2025-12-01T03:25:41.000000+00:00",
        "client_address": "4115 S. 2nd St, , Louisville, KY 40214",
        "client_phone": "(502) 599-8673 Personal Mobile",
        "client_email": "jamesraykiper@hotmail.com",
        "accident_date": "2022-12-05",
        "total_medical_bills": 18225.25,
        "total_expenses": 365.68,
        "total_liens": 687.54,
        "case_last_activity": "12/01/2025 03:25 AM",
        "case_create_date": "2022-12-08",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "James-Lanier-MVA-6-28-2025",
        "client_name": "James Lanier",
        "case_summary": "James Lanier rear-end MVA on 6/28/25 in Alabama at 50mph. Multi-party family case (James, Rebecca, Christopher, Michael Lanier). Client sustained neck, back, and left shoulder injuries including torn rotator cuff with 2 labral tears and C5 cervical bulge. Treating at All Star Chiropractic ($3,640 as of 11/12/25), OrthoCincy with Dr. Schertzinger (tramadol), Dr. Valasquez (PRP), Dr. Greiwe (surgeon). Shoulder debridement surgery recommended (~$17,000, <40% success rate). Cervical MRI scheduled, January follow-up. Progressive Insurance (BI) denying fault under Alabama contributory negligence law. State Farm PIP active (claim #17-87C986K). Property damage: 2022 Dodge Durango, water pump repair $914.44. St. Elizabeth ER bill $866.25. File organization completed 11/30/25: 54% of files organized into 8-bucket structure.",
        "current_status": "Active treatment phase. Client continuing chiropractic care at All Star Chiropractic. Awaiting cervical spine MRI results to determine shoulder surgery timing. Shoulder debridement surgery recommended by Dr. Greiwe (~$17,000 estimate). January follow-up scheduled for cervical spine issues. Progressive Insurance disputing liability using Alabama contributory negligence defense. State Farm PIP claim active. File organization 54% complete - core documents organized, 27 files remain in root for manual review (medical images, narratives, additional records).",
        "last_status_update": "2025-11-30T23:56:00.000000+00:00",
        "client_address": "1962 Hirsch Court\nLouisville, KY 41091",
        "client_phone": "513-288-8834",
        "client_email": "unknown@unknown",
        "accident_date": "2025-06-28",
        "total_medical_bills": 866.25,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:47 PM",
        "case_create_date": "2025-09-05",
        "phase": "File Setup",
        "case_role": "child",
        "parent_project_name": "The-Laniers-MVA-8-28-2025"
      },
      {
        "project_name": "James-Sadler-MVA-4-07-2023",
        "client_name": "James Sadler",
        "case_summary": "Motor vehicle accident case involving James Sadler (plaintiff) and Eyob Tafesse (defendant) that occurred on April 7, 2023, at the intersection of Hikes Lane and Breckenridge Lane in Louisville, Jefferson County, Kentucky. Defendant ran red light causing three-vehicle collision. Client sustained neck and back soft tissue injuries plus dental injuries requiring extensive treatment including tooth extraction and implant. Total medical expenses: $8,266.18. Treatment completed March 2024.\n\nCase filed in Jefferson County Circuit Court (25-CI-000116). Discovery phase complete - our interrogatories served, defendant's responses received 6/16/25. Defense counsel is Allison Rief at Dilbeck & Myers, PLLC. Currently coordinating deposition schedules for both parties. Policy limits demand of $25,000 sent to defense counsel 12/9/25 (14-day deadline expires 12/23/25). Court filing fee $297.94 paid.\n\nAttorney transition: Bryce Koon formerly handled case, now transferred to Aaron Whaley. Next steps: await response to policy limits demand, finalize deposition dates if needed.",
        "current_status": "Active Litigation - Policy Limits Demand Sent",
        "last_status_update": "2025-12-09T19:37:00.000000+00:00",
        "client_address": "298 El Conquistador Pl, Louisville, KY 40220",
        "client_phone": "502-417-5186",
        "client_email": "jmsadler1@hotmail.com",
        "accident_date": "2023-04-07",
        "total_medical_bills": 8266.18,
        "total_expenses": 297.94,
        "total_liens": 425.41,
        "case_last_activity": "12/09/2025 07:37 PM",
        "case_create_date": "2023-05-18",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "James-Woodford-MVA-6-19-2025",
        "client_name": "James Woodford",
        "case_summary": "Client: James Lee Woodford III, DOB 9/8/1985. Accident: 6/19/2025, T-bone collision at Clay St and Main St. Police Report: LMPD #25070128 obtained. Injuries: Neck, back, headache, left shoulder/side pain. Medical Treatment: Initial transport via Louisville Metro EMS to UofL Hospital. Ongoing treatment at Anderson Chiropractic & Rehab and Starlite Chiropractic. Medical records/bills requested from UofL Hospital and EMS on 6/23/2025. Insurance: Kentucky Farm Bureau (PIP & UM, claim #08065806, adjuster Sarah Riggs). State Farm (BI, claim #1786S949G, adjuster Jessica Fones, policy limits not disclosed). American Family Insurance (BI, claim #1009056098) denied coverage. Intake completed 6/24/2025 via VineSign. LORs sent to relevant insurance companies. ⚠️ REPRESENTATION TERMINATED 7/31/2025 - New counsel: Bruce Anderson (Anderson & Vaughn PLLC).",
        "current_status": "⚠️ CASE CLOSED - Client terminated representation on 7/31/2025. All three clients (James Woodford, Patrice Harris, Paxon Woodford) retained new counsel: Bruce Anderson at Anderson & Vaughn, PLLC. File organization completed 12/1/2025 - all documents properly organized in 8-bucket structure with standardized naming. Case ready for file transfer if requested by new counsel. Critical issues: American Family Insurance denied BI claim (policy cancelled 5/1/2022), date discrepancy between police report (6/19/2025) and insurance docs (6/23/2025).",
        "last_status_update": "2025-12-01T03:20:00.000000+00:00",
        "client_address": "539 Southwestern Parkway, Louisville, KY 40211",
        "client_phone": "502-294-6739",
        "client_email": "",
        "accident_date": "2025-06-19",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "12/01/2025 03:20 AM",
        "case_create_date": "2025-06-23",
        "phase": "Closed - Terminated",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Jaysha-Aponte-MVA-3-15-2025",
        "client_name": "Jaysha Aponte",
        "case_summary": "MVA case for Jaysha Aponte (DOB 8/4/92) from 3/15/2025 accident at Roy Wilkins & W. Market. Client suffered concussion, head injury, left arm and lower back pain. Transported by EMS to UofL Hospital ER. Treated at multiple facilities: UofL Hospital ($5,649), ULP Emergency ($403), Louisville Metro EMS ($640.80), Family Health Centers-Portland ($901.18). Total settled medical bills: $7,594.98. Three insurance companies involved: Progressive PIP (client's own - claim #25-311813973, coverage initially pending due to recently purchased vehicle not listed on policy), Mobilitas BI (third party - claim #250-068-9702, coverage pending), and Geico BI (third party - claim #8838008180000001, coverage DENIED possibly due to rideshare exclusion). Police report #25028727 obtained. LORs sent to all carriers. Medical records and bills secured from most providers. Client may have ongoing treatment at Starlite Chiropractic and East Broadway FHC. Progressive requesting verification statement from client regarding treatment bills.",
        "current_status": "Case files fully organized using 8-bucket system (12/1/2025). 93 files organized with 0% error rate - all medical records, insurance correspondence, and investigation documents properly categorized with standardized naming. Identified 8 medical providers and 3 insurance companies. Key issues: (1) Geico BI coverage DENIED due to rideshare exclusion - need UM/UIM strategy, (2) Progressive PIP coverage initially pending - vehicle not listed on policy, (3) Starlite Chiropractic solicitation violation documented (KRS 367.4082), (4) Mobilitas BI claim pending. Medical bills total $7,593.98 from UofL Hospital, Louisville Metro EMS, ULP Emergency, and Family Health Centers. Outstanding: 5 .docx files require manual review, need remaining records from East Broadway FHC and current Starlite treatment status. Ready for comprehensive medical records analysis and settlement demand preparation.",
        "last_status_update": "2025-12-01T08:00:00.000000+00:00",
        "client_address": "315 W. Hill St., Unit B1, Louisville, KY 40208",
        "client_phone": "413-437-6684",
        "client_email": "apontejaysha@gmail.com",
        "accident_date": "2025-03-15",
        "total_medical_bills": 7593.98,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "12/01/2025 03:00 AM",
        "case_create_date": "2025-03-17",
        "phase": "Demand in Progress",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Jensen-Ott-MVA-8-06-2025",
        "client_name": "Jensen Ott",
        "case_summary": "Motor vehicle accident case involving Jensen Ott and family members (Joseph and Maia) that occurred on 8/06/2025. This is an individual case within the larger family case \"The-Otts-MVA-8-06-2025\". Client has provided SSNs for all family members involved (Jensen: 710-53-3913, Joseph: 403411914, Maia: 103718488). Client is currently seeing primary care doctor and has committed to providing medical documents after appointment. Case is in initial File Setup phase with basic intake information collected but still requires comprehensive fact development including accident details, injuries, medical treatment, insurance information, and document collection.",
        "current_status": "File Setup - Initial intake completed with client contact information and SSNs obtained. Awaiting medical documents from client's primary care appointment. Need to conduct comprehensive fact development interview to determine accident details, injuries, medical providers, insurance coverage for all parties, and property damage. No insurance claims initiated yet. Case requires systematic workflow review per office standards.",
        "last_status_update": "2025-09-12T02:10:50.399461+00:00",
        "client_address": "",
        "client_phone": "502-616-6505",
        "client_email": "unknown@unknown",
        "accident_date": "2025-08-06",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "09/07/2025 10:36 AM",
        "case_create_date": "2025-09-05",
        "phase": "File Setup",
        "case_role": "child",
        "parent_project_name": "The-Otts-MVA-8-06-2025"
      },
      {
        "project_name": "Jeremy-Lindsey-MVA-12-01-2024",
        "client_name": "Jeremy Lindsey",
        "case_summary": "Motor vehicle accident on December 1, 2024, in Boone County involving Jeremy Lindsey family (Jeremy, Elizabeth, Chase, Owen) and another party (Dominic). Jeremy sustained minor injuries treated at St. Elizabeth Physicians-Burlington with single visit on 12/05/24. Family members also injured: Elizabeth required physical therapy through April 2025, Chase had broken collarbone treated at Cincinnati Children's with final X-ray 04/02/25, Owen treated at Cincinnati Children's completed by 12/11/24. Progressive Insurance (claim #24-902741838) settled for $49,500 after liens. Auto Owners Insurance provided UIM coverage (claim #300-793616-2024) with multiple exposures opened for all family members. Coots letter sent 04/21/25. Outstanding medical bills totaled approximately $6,089.37 for family members. Case settled and closed with settlement checks issued.",
        "current_status": "Case closed - settlement completed. Progressive paid $49,500 after liens resolved. All family members completed medical treatment by April 2025. Settlement checks have been issued to family. Outstanding medical bills being processed through Auto Owners PIP coverage.",
        "last_status_update": "2025-09-12T02:01:40.071289+00:00",
        "client_address": "1233 Citation Dr, Union, KY 41091",
        "client_phone": "502-424-0049",
        "client_email": "jeremylindsey1978@yahoo.com",
        "accident_date": "2024-12-01",
        "total_medical_bills": 307,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2024-12-03",
        "phase": "Negotiation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Jerome-Hedinger-Premise-DB-10-24-2023",
        "client_name": "Jerome Hedinger",
        "case_summary": "Jerome Hedinger dog bite premises liability case from 10/24/23. Client and his dog Rory attacked by defendant's pit bull at 432 Atwood LLC property (rented by Dahlyn Brown). Client treated at Baptist Health ER ($1889.59 bill settled for $289.89), Ultimate MD (Dr. Haney), and Jefferson Animal Hospital for Rory ($525.58). Client experiencing PTSD with panic attacks around pit bulls. Case filed as Jerome Hedinger v. 432 Atwood, LLC, et al. (Jefferson Circuit 24-CI-006943). Policy limit demand ($25,000) sent to State Farm 7/23/24. Currently in litigation with Motion to Compel pending (hearing 6/2/25). Defense offered $2500. Individual defendants Brown/Burden have not answered complaint despite service.",
        "current_status": "In active litigation phase. Defendants: Dahlyn Brown (dog owner/renter), 432 Atwood LLC (property owner), Jessica Burden (Brown's sister added 10/29/24). Defense counsel: Dinsmore & Shohl LLP. Discovery responses due 4/18/25 but still outstanding. Motion to Compel filed 5/13/25, hearing set 6/2/25. Brown/Burden served but haven't answered - considering default judgment. State Farm offered $2500. Client experiencing PTSD, seeing therapist. OVERDUE: Need to discuss offer with client and provide counter-offer.",
        "last_status_update": "2025-09-10T19:33:40.956767+00:00",
        "client_address": "10008 Smock Mill Ln, Temple, TX 76502",
        "client_phone": "(502) 417-2550",
        "client_email": "jlhedinger@gmail.com",
        "accident_date": "2023-10-24",
        "total_medical_bills": 2415.17,
        "total_expenses": 554.25,
        "total_liens": 15.09,
        "case_last_activity": "12/01/2025 03:35 PM",
        "case_create_date": "2023-12-28",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Jessica-Mahaney-MVA-03-09-2025",
        "client_name": "Jessica Mahaney",
        "case_summary": "Jessica Mahaney, age 41, sustained lower back and left hip injuries in an MVA on 3/9/2025 in Jeffersonville (PD Report #202510418). Client was out of work from 3/9/2025 to 3/27/2025 at $17.50/hour wage rate. Medical treatment included: Scott County Chiropractic with Dr. David Ivey (3/20/2025 - July 2025) and MRI at 1st Diagnostics (4/10/2025, billed $3,900, settled for $183.52). Progressive Insurance Company providing both UM and PIP coverage with claim #25-615241502. UM adjuster: Kara Hoskins, PIP adjuster: Katie Mills. All medical records and bills obtained. Client completed treatment July 2025. Demand letter sent to UM carrier on 8/13/2025. Initial settlement offer received 8/19/2025. Wage verification form completed. Case ready for settlement negotiations.",
        "current_status": "Settlement negotiations in progress. Demand sent 8/13/2025, initial UM offer received 8/19/2025. Awaiting settlement discussions and potential counteroffers. All medical treatment completed and documented.",
        "last_status_update": "2025-09-12T07:34:30.677919+00:00",
        "client_address": "512 Mabel Lane, Scottburg, IN 47170",
        "client_phone": "502-230-0975",
        "client_email": "",
        "accident_date": "2025-03-09",
        "total_medical_bills": 3900,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2025-03-19",
        "phase": "Settlement",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Jimmy-Ferguson-MVA-5-30-2024",
        "client_name": "Jimmy Ferguson",
        "case_summary": "Jimmy Ferguson sustained neck and back injuries in a motor vehicle accident on May 30, 2024 in Elizabethtown, KY. He received emergency treatment at Baptist Health Hardin, underwent diagnostic imaging (X-rays, MRI), and completed physical therapy at KORT Elizabethtown PT. Medical treatment concluded July 2025. Total medical bills: $7,143.82 (Baptist Health Hardin $6,446.82, Elizabethtown Emergency Physicians $595.00, Radiology Associates $102.00). Kentucky Farm Bureau PIP coverage ($10,000 limit) was exhausted paying initial medical bills. Letter of representation sent to KACo Claims Department (other driver's BI carrier) on 11/25/24, claim #VA20241535681 assigned to adjuster Vivian Hall. All medical records and bills collected. Police report obtained. Case ready for settlement demand preparation.",
        "current_status": "Treatment completed July 2025. All medical records and bills collected. PIP exhausted ($10,000). BI claim established with KACo Claims (adjuster: Vivian Hall). Ready to prepare and send settlement demand package. Outstanding task: Update case overview due 8/29/25.",
        "last_status_update": "2025-09-12T07:33:54.824033+00:00",
        "client_address": "122 Alumni Drive, Elizabethtown, KY 42701",
        "client_phone": "270-319-9516",
        "client_email": "jimmyferguson795@yahoo.com",
        "accident_date": "2024-05-30",
        "total_medical_bills": 7143.82,
        "total_expenses": 51.38,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2024-07-08",
        "phase": "Demand in Progress",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Jonah-Price-MVA-8-25-2025",
        "client_name": "Jonah Price",
        "case_summary": "MVA case for Jonah Price (8/25/2025). Client rear-ended at Dixie Highway/Old Hooters while stopped at light. Injuries: back and left leg. Treated at UofL Hospital (ER) and Starlite Chiropractic. At-fault vehicle (Unit 1) uninsured. Farmers BI coverage denied. Client has Mobilitas PIP coverage (needs confirmation). Police report #25100181 obtained. Client is Uber driver with lost wages through Elmwood staffing. Previous gunshot wound 1.5 years prior at UofL. Health insurance: Passport.",
        "current_status": "Investigation phase progressing. Police report #25100181 secured and saved. Confirmed Unit 1 (at-fault party) uninsured - Farmers BI coverage appropriately denied. CC request faxed 9/6/25. Next priorities: Confirm/activate Mobilitas PIP coverage, request medical records/bills from UofL Hospital and Starlite Chiropractic, document lost wages with Elmwood staffing, establish regular client communication schedule.",
        "last_status_update": "2025-09-12T07:36:19.937975+00:00",
        "client_address": "3101 Elliot Ave\nLouisville, KY 40211",
        "client_phone": "502-356-4203",
        "client_email": "unknown@unknown",
        "accident_date": "2025-08-25",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "09/07/2025 10:36 AM",
        "case_create_date": "2025-09-05",
        "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Jordan-Brown-MVA-8-19-2025",
        "client_name": "Jordan Brown",
        "case_summary": "Motor vehicle accident case for Jordan Brown (DOB: 6/15/1999). Accident occurred 8/19/2025 on 7th Street, Louisville where client was rear-ended while stopped at red light and pushed into school bus. Client transported to UofL Hospital via EMS. Injuries include neck, back, left knee, and right shoulder. Police report obtained (LMPD Report # SHV25-001540). Client has been receiving ongoing chiropractic treatment at Starlite Chiropractic. Fee agreement signed and intake completed. Multiple accident photos obtained. Letters of representation sent to SafeCo Insurance (coverage cancelled, denial expected), Progressive Insurance, and Root Auto Insurance (client's PIP coverage). Active communication with adjusters ongoing.",
        "current_status": "Client treatment ongoing and progressing well. Police report and accident photos obtained. LORs sent to all identified insurance companies. SafeCo coverage was cancelled prior to accident - setting up for denial letter. Progressive adjuster reviewing liability. Root Auto Insurance PIP claim established. Need to request medical records/bills from UofL Hospital, EMS, and Starlite Chiropractic once treatment phase progresses further. Recent client contact 9/6/2025 confirmed treatment going well.",
        "last_status_update": "2025-09-12T02:10:53.563404+00:00",
        "client_address": "3416 Cathe Dykstra Way\nUnit 102\nLouisville, KY 40216",
        "client_phone": "502-996-2342",
        "client_email": "jordan.brown2300@icloud.com",
        "accident_date": "2025-08-19",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2025-09-05",
        "phase": "File Setup",
        "case_role": "child",
        "parent_project_name": "Leanora-and-Jordan-Brown-MVA-8-19-2025"
      },
      {
        "project_name": "Joseph-Ott-MVA-8-06-2025",
        "client_name": "Joseph Ott",
        "case_summary": "Joseph Ott MVA on 8/6/2025 at Okalona blue brick road and South Park Road. Client suffered concussion, neck/back pain, glass in arm, left shoulder injury. Treated at UofL Health West Hebron Lane ER 8/6/25, also seeing Starlite Chiropractic. Progressive Insurance (BI coverage) - new adjuster Brittany Young assigned 8/25, coverage under investigation. Client has Direct Insurance. LMPD Report #25091782. Last client contact 8/26 - no PD claim response yet, client scheduling PCP appointment to see specialist. Need: accident report, insurance details, medical records/bills, PIP claim info.",
        "current_status": "Active investigation phase. Progressive BI coverage under investigation with new adjuster. Awaiting PD claim response and client PCP specialist referral. Medical records and bills not yet requested from UofL ER or Starlite Chiropractic.",
        "last_status_update": "2025-09-12T11:56:17.321641+00:00",
        "client_address": "3820 leland Rd\nApt. 1\nLouisville, KY 40207",
        "client_phone": "502-616-6505",
        "client_email": "unknown@unknown",
        "accident_date": "2025-08-06",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2025-09-05",
        "phase": "File Setup",
        "case_role": "child",
        "parent_project_name": "The-Otts-MVA-8-06-2025"
      },
      {
        "project_name": "Juanita-Nicole-Downs-MVA-4-16-2021",
        "client_name": "Juanita Nicole Downs",
        "case_summary": "MVA case from 4/16/21 involving stolen vehicle. Client Juanita Nicole Downs sustained bilateral ankle injuries requiring surgery. Filed suit in Jefferson Circuit Court (22-CI-002878) against Stephanie Nail and Allstate. Key issues: Stolen vehicle coverage dispute with Allstate. Insurance: Nationwide PIP confirmed ($617417-GM), Allstate BI under investigation ($625854435), KAC confirmed ($202111021). Medical treatment completed 11/22/21. Total medical bills ~$59K. Currently facing critical summary judgment motions from both defendants requiring immediate responses.",
        "current_status": "Active litigation - Summary judgment motions filed by both Allstate (9/3/25) and Turner (8/28/25). URGENT: Response deadlines may be missed - Turner response due 9/17/25, Allstate response due 9/22/25. Awaiting immediate action.",
        "last_status_update": "2025-09-12T01:59:25.346627+00:00",
        "client_address": "3109 Ford Haven Road #6, Louisville, Ky 40214",
        "client_phone": "502-965-3423 Personal Mobile",
        "client_email": "juanitadowns98@gmail.com",
        "accident_date": "2021-04-16",
        "total_medical_bills": 59143.53,
        "total_expenses": 512.57,
        "total_liens": 20669.08,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2021-12-15",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Julmonzhae-Moore-MVA-8-29-2023",
        "client_name": "Julmonzhae Moore",
        "case_summary": "Motor vehicle accident case involving Julmonzhae Moore from 8/29/23 in New Albany, IN. Multi-party collision where client's vehicle turned left and was struck. Client transported to UofL Hospital and treated at Starlite Chiropractic. Total medical bills: $31,371.40 from 6 providers (AmeriPro EMS, UofL Hospital, UofL Physicians, ULP Radiology, Virtual Radiologic, Starlite Chiropractic). Four insurance companies involved: Liberty Mutual PIP (confirmed coverage), Liberty Mutual BI (SETTLED $14,734.08 on 9/12/24), Elco Insurance (coverage denied), State Farm BI (confirmed coverage, claim pending). Lawsuit filed: Williams, Ward, Moore v. Robinson (Floyd 22D03-2501-CT-000157). Health insurance liens from TeamCare and Central States identified.",
        "current_status": "Active litigation - discovery phase. Liberty Mutual BI settled 9/12/24 for $14,734.08. State Farm BI claim ongoing with demand sent 12/15/23. Discovery served 5/5/25, defendant responses due 7/7/25 (extended). Client interrogatory responses prepared 7/22/25. Medical records requests ongoing for all providers. Awaiting State Farm response to settlement demand. Next: Follow up on defendant's discovery responses and continue State Farm negotiations.",
        "last_status_update": "2025-09-12T07:40:18.674107+00:00",
        "client_address": "1600 Brick Kiln Ln, Louisville, KY 40216",
        "client_phone": "502-837-1217",
        "client_email": "julmonzhae.moore@gmail.com",
        "accident_date": "2023-08-29",
        "total_medical_bills": 31371.4,
        "total_expenses": 537.85,
        "total_liens": 3318.77,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2023-08-30",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Justin-Bullock-MVA-6-30-2025",
        "client_name": "Justin Bullock",
        "case_summary": "Motor vehicle accident case for Justin Bullock from June 30, 2025. Client sustained injuries to left shoulder, knee, and lower back. Initial ER treatment at St. Mary & Elizabeth Hospital (no EMS transport), followed by chiropractic treatment at Starlite Chiropractic. Client voluntarily completed treatment on July 16, 2025, reporting no longer experiencing pain. BI liability accepted by Progressive Insurance (claim #25631251364, adjuster Joshua White). PIP coverage through Kentucky Farm Bureau (claim #5117901, adjuster Casey May, coverage pending). All medical records and bills received from all treating providers. Police reports obtained and on file. Multiple paystubs for wage documentation available. LOR sent to both insurance companies with confirmations received. Client received $1,000 legal funding loan. Case transitioned to Demand in Progress phase on July 23, 2025. Comprehensive documentation package ready for settlement demand preparation.",
        "current_status": "Demand in Progress phase. All medical treatment completed as of July 16, 2025. All medical records and bills collected from treating providers (St. Mary & Elizabeth Hospital, Starlite Chiropractic, Southeastern Emergency Physicians). BI liability accepted by Progressive Insurance. Police reports and wage documentation on file. Outstanding task: update case overview (overdue since 8/29/25). Case fully prepared for settlement demand submission to Progressive Insurance.",
        "last_status_update": "2025-09-12T07:40:42.146632+00:00",
        "client_address": "4408 Hazlewood Ave, Louisville, KY 40215",
        "client_phone": "606-205-3990",
        "client_email": "",
        "accident_date": "2025-06-30",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2025-07-01",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Kimberly-Brasher-Premise-2-25-2023",
        "client_name": "Kimberly Brasher",
        "case_summary": "Fall in Walgreens parking lot. hip replacement. Walgreens was not in business. Issue with what level of tresspasser. ",
        "current_status": "Need to get client to resolve - Scheduling order entered - Need to schedule Walgreens rep depo if can’t resolve",
        "last_status_update": null,
        "client_address": "46 Whispering Pines Ct, Hanson, KY 42413",
        "client_phone": "270-213-0471",
        "client_email": "kimberbrasher73@gmail.com",
        "accident_date": "2023-02-25",
        "total_medical_bills": 137582.62,
        "total_expenses": 1191.11,
        "total_liens": 35169.71,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2023-09-18",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Leanora-and-Jordan-Brown-MVA-8-19-2025",
        "client_name": "Leanora and Jordan Brown",
        "case_summary": null,
        "current_status": null,
        "last_status_update": null,
        "client_address": "",
        "client_phone": "5025555555",
        "client_email": "unknown@unknown",
        "accident_date": "2025-08-19",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "09/07/2025 01:12 PM",
        "case_create_date": "2025-09-07",
        "phase": "File Setup",
        "case_role": "parent",
        "parent_project_name": null
      },
      {
        "project_name": "Leanora-Brown-MVA-8-19-2025",
        "client_name": "Leanora Brown",
        "case_summary": "Motor vehicle accident case for Leanora Brown on 8/19/2025. Client had seizure in car and required extraction, transported by Louisville Metro EMS to University of Louisville Hospital with injuries to neck, back of head, right shoulder, right hip, right leg, and back. Initial intake completed 8/20/2025. Letters of representation sent to Progressive Insurance (other party's BI coverage) on 8/29/2025 and Root Insurance (client's PIP coverage) on 8/28/2025. Carrier discovery completed confirming Progressive coverage. Police report obtained from Shively Police Department. Client scheduled for ongoing chiropractic treatment at Starlite Chiropractic. Case coordinated with related Jordan Brown case (family member).",
        "current_status": "Demand in Progress phase. Client completed treatment 11/13/2025. File organization completed 12/01/2025 with all documents properly categorized in 8-bucket system. Medical records received from Louisville Metro EMS and University of Louisville Hospital. EMS bill $667.40 confirmed. Root PIP exhausted ($10,000 paid to Starlite Injury per 11/17/2025 ledger). Awaiting Starlite Chiropractic records/bills (requested 11/13/2025 and 11/20/2025). Insurance confirmed: SafeCo BI claim 060018233 (at-fault carrier for Betty J Antle), Progressive BI claim 25-822910337 (coverage denied), Root PIP claim TJ6L8DKY (exhausted). Next actions: Obtain Starlite records/bills, prepare demand package for SafeCo, coordinate with Jordan Brown case (related family member).",
        "last_status_update": "2025-12-01T14:58:00.000000+00:00",
        "client_address": "3416 Cathe Dykstra Way\nUnit 102\nLouisville, KY 40216",
        "client_phone": "502-631-5745",
        "client_email": "unknown@unknown",
        "accident_date": "2025-08-19",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "12/01/2025 02:58 PM",
        "case_create_date": "2025-09-05",
        "phase": "Demand in Progress",
        "case_role": "child",
        "parent_project_name": "Leanora-and-Jordan-Brown-MVA-8-19-2025"
      },
      {
        "project_name": "Lejzane-Miftari-MVA-6-18-2025",
        "client_name": "Lejzane Miftari",
        "case_summary": "MVA case for Lejzane Miftari, DOB 6/30/1996, involving accident on 6/18/2025 on Valley Station Road near Circle K, Louisville while making right turn into neighborhood. Client sustained right leg, neck, and back pain. Police Report: LMPD #25069557 (received 10/29/2025 after months of searching). Treated at Saint Mary & Elizabeth Hospital ER ($10,838.20), Southeastern Emergency Services ($1,798 settled), and Starlite Chiropractic 6/26-8/11/2025 ($10,360). Total medical bills: $22,996.20. Direct Auto Insurance PIP claim #250488368 (adjuster: Melinda Tracy, 800-468-3466 ext 24461) - $6,000 paid, $4,000 remaining as of 9/10/2025. UIM claim opened 11/17/2025 (adjuster: Danelle Lendsey, 336-331-6438). LOR sent 6/20/2025, confirmed 7/7/2025. Medical records requested from UofL Health 10/29/2025. File organization completed 12/1/2025 - all documents properly categorized in 8-bucket system.",
        "current_status": "Treatment Complete - Ready for Settlement Demand. Police report #25069557 received 10/29/2025. Starlite Chiropractic treatment completed 8/11/2025 (records received 9/10/2025). UIM claim opened 11/17/2025. Outstanding: UofL Health records requested 10/29/2025 (now overdue - follow up needed). Client called 11/18/2025 expressing concern about lack of communication - needs status update. Next steps: (1) Follow up on UofL records, (2) Review police report for liability, (3) Update client on case progress, (4) Prepare settlement demand once all records received.",
        "last_status_update": "2025-12-01T03:55:00.000000+00:00",
        "client_address": "13010 Bessels Blvd, Louisville, KY 40272",
        "client_phone": "502-823-4776",
        "client_email": "",
        "accident_date": "2025-06-18",
        "total_medical_bills": 22996.2,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "12/01/2025 03:55 AM",
        "case_create_date": "2025-06-20",
        "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Lonnie-Stevens-MVA-2-14-2025",
        "client_name": "Lonnie Stevens",
        "case_summary": "Lonnie Stevens MVA case from 2/14/25 - Client was passenger in collision with JCPS school bus in Louisville, KY. Sustained neck/back injuries, treated by Louisville Metro EMS (transported to UofL Hospital), ER treatment same day, then 23 chiropractic visits at Starlite (2/18/25-4/17/25). Total medical bills: $29,624 ($653.40 EMS paid, $20,190.60 UofL unpaid, $8,780 Starlite paid via PIP). Insurance: State Farm PIP (claim #17-Q610-2P9, adjuster Brad Murray) and MGM BI (claim #VA20251695455, adjuster Mike Gilligan, replaced Dennis Corley). Demand sent 6/30/25 for $50,000. CRITICAL: Client passed away 5/21/25 - estate contacts: Mother Barbara Stevens (757-535-7441), Daughter Tera Jordan (757-297-9882). Missing records: UL Physicians & ULP Radiological Associates. Have police report, EMS records, UofL records, Starlite records, demand package, insurance correspondence.",
        "current_status": "Negotiation phase - $50,000 demand sent to MGM BI adjuster 6/30/25. Client deceased 5/21/25, working with estate representatives (mother Barbara Stevens, daughter Tera Jordan). Awaiting response from MGM on settlement demand. Need to follow up on missing medical records from UL Physicians and ULP Radiological Associates. Total medical bills $29,624 with $20,190.60 UofL bill outstanding. Next action: Follow up with MGM adjuster on settlement negotiations and coordinate with family on estate matters.",
        "last_status_update": "2025-09-12T01:59:43.924221+00:00",
        "client_address": "6118 Guardian Ct, Apt 1, Louisville, KY 40219",
        "client_phone": "757-228-9186",
        "client_email": "",
        "accident_date": "2025-02-14",
        "total_medical_bills": 29624,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2025-02-19",
        "phase": "Settlement",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Maia-Ott-MVA-8-06-2025",
        "client_name": "Maia Ott",
        "case_summary": "Child case from 8/6/2025 MVA. Part of The-Otts-MVA-8-06-2025 family case. Treated at Auto Accident Urgent Care for chiropractic care (visits 2-14 documented). Insurance: NGIC PIP coverage (ledger dated 10/6/2025). Settlement demand sent 11/11/2025 to WLF. File organization completed 12/1/2025 - all documents organized in 8-bucket system with standardized naming.",
        "current_status": "File Setup - Settlement demand sent 11/11/2025. File organization completed with all medical records, insurance documents, and settlement demand properly organized. Case folder ready for active management.",
        "last_status_update": "2025-12-01T04:20:00.000000+00:00",
        "client_address": "",
        "client_phone": "502-616-6505",
        "client_email": "unknown@unknown",
        "accident_date": "2025-08-06",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "12/01/2025 04:20 AM",
        "case_create_date": "2025-09-05",
        "phase": "File Setup",
        "case_role": "child",
        "parent_project_name": "The-Otts-MVA-8-06-2025"
      },
      {
        "project_name": "Malcom-Glass-Jones-MVA-10-2-2024",
        "client_name": "Malcom Glass-Jones",
        "case_summary": "MVA of 10/2/24. Client Malcom Glass Jones (DOB: 3/14/2006) sustained low back and shoulder pain, treated at Starlite Chiropractic for 5 visits ($1,280 settled). Three insurance companies involved: Shelter Insurance (BI & PIP) and Kentucky Farm Bureau (BI). Demand sent 7/7/25 for $10,000. Settlement offer received 7/16/25. Major issue: Client has become unresponsive since March 2025, hangs up when MVA mentioned, voicemail full, multiple failed contact attempts. All documentation complete including police reports, medical records, insurance correspondence.",
        "current_status": "Settlement offer received 7/16/25 but client unreachable - multiple contact attempts failed, voicemail full, client appears disinterested. Next action: Continue attempts to contact client regarding settlement offer, may need to send certified letter requiring response.",
        "last_status_update": "2025-09-12T02:02:26.548262+00:00",
        "client_address": "1442 Altawood Dr, Clarksville, IN 47129",
        "client_phone": "812-832-8198",
        "client_email": "",
        "accident_date": "2024-10-02",
        "total_medical_bills": 1280,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2024-10-10",
        "phase": "Negotiation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Mark-Smith-Jr-MVA-5-31-2025",
        "client_name": "Mark Smith Jr",
        "case_summary": "Motor vehicle accident case for Mark Smith Jr. (DOB: 5/17/1992, SSN: 406-43-8385, Phone: 502-424-6743). Accident occurred on 5/31/2025 at Hikes Lane near Klondike light, a T-bone collision where an at-fault driver from Cox Smoke Outlet crossed both lanes, striking client's driver side. LMPD responded. Client transported by Fern Creek Fire & EMS to University of Louisville Hospital with extensive injuries including right shoulder, neck, entire back, both hips, abdomen, bilateral knees, right wrist, and pancreas. \n\nMEDICAL TREATMENT: Emergency care at UofL Hospital ($20,297) and EMS transport ($920.40) totaling $21,217.40, fully paid by State Farm PIP. Client is currently undergoing ongoing treatment at Starlite Chiropractic (treatment dates/amounts TBD). Medical records have been obtained from UofL Hospital and Fern Creek EMS. Starlite Chiropractic records were requested on 7/7/25, but no response has been received to date.\n\nINSURANCE: State Farm Personal Injury Protection (PIP) coverage is confirmed (Claim #1785Q936Q, Adjuster: Joseph Dedeyn). No Uninsured/Underinsured Motorist (UIM) coverage is available. USAA Bodily Injury (BI) coverage for the at-fault party (Claim #001218586-803, Adjuster: Taline Clestine, Email: 3j7z9m3b3p7wh@claims.usaa.com) is still pending confirmation. Letters of representation were sent to both insurance companies on 6/3/25. Justin Chumbley from Whaley Law Firm also initiated contact with USAA on 6/4/25 regarding the BI claim, which involved phone tag with adjuster Peyton (ext 32143).\n\nDOCUMENTATION: The police report is on file. Intake was completed and signed on 6/3/25. Photos of injuries and the accident scene have been provided by the client. Health insurance card images have been obtained. Extensive medical records and bills for emergency treatment are secured. Property damage claim initiated with State Farm on 6/3/25.\n\nCOMMUNICATIONS: Welcome call and email for client recommended on 6/11/25. Justin Chumbley requested health insurance card and accident photos from client on 6/9/25. Contact with UofL business office regarding Mark Smith & son on 6/11/25. Records and billing for Mark Smith Sr. & Jr. requested from Starlight Chiropractic and Gail Sweasy on 7/7/25. State Farm medical records mailed to Justin Chumbley on 7/22/25.\n\nCURRENT STATUS: The case is in the Treatment phase. There are three overdue follow-up items:\n1. Confirm USAA bodily injury coverage limits (due 9/3/25).\n2. Follow up on Starlite Chiropractic records and billing (due 9/5/25).\n3. Update case overview (due 8/29/25, already completed by this update).\n\nNext anticipated actions include following up on the overdue items to progress the case towards demand and settlement phases. Client's email and address are still needed.",
        "current_status": "Treatment Phase - Critical Follow-ups Overdue: USAA BI coverage confirmation and Starlite Chiropractic records/billing. Emergency medical treatment documented and paid. Client continuing care at Starlite. Comprehensive case review and memory synchronization completed.",
        "last_status_update": "2025-09-13T07:47:28.162543+00:00",
        "client_address": "6027 Barley Ave, Louisville, KY 40218",
        "client_phone": "502-424-6743",
        "client_email": "",
        "accident_date": "2025-05-31",
        "total_medical_bills": 21217.4,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2025-06-02",
        "phase": "Treatment",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Mark-Smith-Sr-MVA-5-31-2025",
        "client_name": "Mark Smith Sr",
        "case_summary": "Mark Smith Sr (DOB 11/14/1962) and his son Mark Smith Jr were involved in a motor vehicle accident on 5/31/2025. Police report #25061987 on file. Both clients sustained significant injuries: Mark Sr suffered right shoulder, left shoulder, chest, and entire back injuries; Mark Jr sustained right shoulder, neck, entire back, both hips, abdomen, right and left knee, right wrist, and pancreas injuries. Both were transported by Fern Creek Fire & EMS to University of Louisville Hospital downtown.\n\nINSURANCE STATUS: USAA (liability carrier, claim #001218586-803) accepted responsibility on 6/4/2025 with more than minimum policy limits. State Farm PIP (claim #1785Q936Q) benefits have been exhausted at $24,417.20 total paid. No UIM coverage available.\n\nTREATMENT COMPLETED: As of 7/23/2025, both clients completed treatment and case moved to \"Demand in Progress\" phase. \n\nMEDICAL RECORDS STATUS: Records and bills received from Starlite Chiropractic ($1,280 settled), Fern Creek Fire & EMS ($1,120.40 settled), University of Louisville Hospital ($22,016.80 settled), American Chiropractic, and Health Lift Pharmacy. Still awaiting final medical records and bills from U of L Health Urgent Care Buechel (requested 7/29/2025).\n\nNEXT STEPS: Case is ready for settlement demand preparation upon receipt of outstanding U of L Urgent Care records. All major documentation in place including police report, intake documents, insurance acknowledgments, and comprehensive medical records from treating providers.",
        "current_status": "Ready for Settlement Demand - Awaiting Final Medical Records from U of L Urgent Care Buechel",
        "last_status_update": "2025-09-12T07:50:25.445551+00:00",
        "client_address": "6027 Barley Ave, Louisville, KY 40218",
        "client_phone": "502-295-6568",
        "client_email": "",
        "accident_date": "2025-05-31",
        "total_medical_bills": 24417.2,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2025-06-02",
        "phase": "Demand in Progress",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Marvynn-Alexandre-Leandre-MVA-04-18-2023",
        "client_name": "Marvynn Alexandre",
        "case_summary": "MVA case filed 4/18/23. Client Marvynn Alexandre Leandre was driving straight through intersection when defendant Trevor Logsdon made left turn causing collision. State Farm initially denied liability but $39,000 demand sent 11/9/23. Amended complaint filed due to defendant name error (Trevor not Steven). Discovery responses exchanged 12/9/24. Case in litigation - Jefferson Circuit Court 24-CI-003910. Defendant has filed countersuit against client. Treatment completed at UofL Hospital ER, VIP Imaging, Southeastern Emergency Services, and Starlite Chiropractic. Total medical bills $12,826. Some settlement payments made ($4,674.40). Hospital bill $8,036 remains unpaid. PIP coverage denied by Erie (vehicle registered to Stevenson Nerva), Progressive PIP pending. Depositions rescheduled for September 17, 2025.",
        "current_status": "Discovery ongoing. Defendant filed countersuit against client. Depositions rescheduled for 09/17/25 after co-counsel discovery response delay was resolved. Need to confirm and inform client of deposition date.",
        "last_status_update": "2025-09-12T02:22:56.703305+00:00",
        "client_address": "6103 Top Hat Ct, , Louisville, KY 40258",
        "client_phone": "(502) 302-2360 Personal Mobile",
        "client_email": "marvynnalexander@yahoo.com",
        "accident_date": "2023-04-18",
        "total_medical_bills": 12826,
        "total_expenses": 387.58,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2023-04-24",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Maryan-Kassim-MVA-08-06-2024",
        "client_name": "Maryan Kassim",
        "case_summary": "Motor vehicle accident on August 6, 2024 involving client Maryan Kassim in Louisville, KY. Client sustained facial trauma and broken tooth requiring ongoing dental treatment. Initially treated at Norton Audubon Hospital and transferred to UofL Hospital for facial trauma. Transported by Louisville Metro EMS. Completed chiropractic treatment at Starlite Chiropractic (8/8/24-10/10/24, 21 visits, $8,185). Currently receiving ongoing dental treatment at University of Louisville School of Dentistry for broken tooth. Medical bills to date approximately $28,866. Progressive Insurance Company provides both BI coverage (Adjuster: Brandi Chappell-Haggard) and PIP coverage (Adjuster: Keri Hall). PIP benefits actively utilized with $6,000 paid and $4,000 reserved. Police report obtained. Photo documentation of injuries exists. Medicaid lien from Conduent on file. All medical records and bills received except ongoing dental bills.",
        "current_status": "Treatment phase - Client completed chiropractic treatment (10/10/24) but continues dental treatment at UofL School of Dentistry for broken tooth from MVA. PIP benefits being utilized for medical expenses. Awaiting completion of dental treatment to proceed with demand preparation. Regular follow-up with PIP adjuster Keri Hall regarding reservation status. Next action: Monitor dental treatment completion and prepare comprehensive demand package once treatment concludes.",
        "last_status_update": "2025-12-01T16:51:28.103163",
        "client_address": "1816 Clinton Pl, Louisville, KY 40216",
        "client_phone": "502-333-2962",
        "client_email": "ishahope11@gmail.com",
        "accident_date": "2024-08-06",
        "total_medical_bills": 28865.99,
        "total_expenses": 0,
        "total_liens": 3830.39,
        "case_last_activity": "12/01/2024 04:45 PM",
        "case_create_date": "2024-08-12",
        "phase": "Treatment",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Michael-Crader-MVA-5-19-2023",
        "client_name": "Michael Crader",
        "case_summary": "Motor vehicle accident case for Michael Crader, veteran farmer, from May 19, 2023 in Morgan County, KY. Client was operating Can Am Defender farm utility vehicle when struck by defendant Megan Combs (Police Report #2023-04670).\n\nINJURIES & TREATMENT: Client sustained serious injuries requiring Morgan County EMS transport, Air Methods air evacuation to UK Albert Chandler Hospital, and extensive ongoing VA treatment including L5-S1 issues with potential epidural recommended. Treatment includes West Liberty Physical Therapy (completed 1/8/24-4/4/24), Morehead VA Clinic, Troy Bowling Campus VA Clinic, and Morehead Physical Therapy.\n\nMEDICAL EXPENSES: Total medical bills exceed $100,000:\n- Air Methods: $82,859.12 (unpaid)\n- UK Albert Chandler Hospital: $37,316.90 (settlement paid)  \n- West Liberty Physical Therapy: $2,905.00 (unpaid)\n- Morgan County EMS: $1,331.20 (unpaid)\n- VA treatment ongoing with significant costs\n\nINSURANCE STATUS:\n- Kentucky Farm Bureau (defendant BI): $25,000 policy limits confirmed, claim #4863358, adjuster Holly Highley - COVERAGE CONFIRMED\n- Erie Insurance (client UIM): claim #A00005338855, adjuster Frank Smith - COVERAGE DENIED (policy not active at time of loss)\n- Everett Cash Mutual (client PIP): claim #12301632, adjuster Tarin Kokoska - COVERAGE DENIED (farm equipment not covered as motor vehicle)\n\nLITIGATION: Lawsuit filed 5/21/2024 in Morgan Circuit Court (24-CI-00065) against Megan Combs. Discovery requests served 5/21/2024, defendant's answer received 7/31/2024, written discovery completed by both sides 8/29/2024. Defense counsel: John Ellis (Dehner & Ellis). Multiple policy limits demands sent, most recent 3/5/2025.\n\nCRITICAL ISSUE - VA LIEN SHORTFALL: VA lien of $86,505.91 (final amount received 12/30/2024) vs. maximum potential recovery of $25,000 policy limits creates $61,505.91 shortfall. Attorney Bryce Koon contacted VA OGC (Louise Stevenson) 4/2/2025 to discuss resolution options.\n\nECONOMIC DAMAGES: Lost wages include $300 for part-time worker called in day of accident (paid by KFB), $10,800 for waterline installation (not reimbursed), spouse's work impacted by client's inability to perform farm duties.\n\nCLIENT CONTACT: Last contact 4/7/2025 regarding fund distribution discussions. Client is self-employed veteran farmer (michaelcrader67@gmail.com, 406-439-1144).",
        "current_status": "Settlement negotiations ongoing - Policy limits demand sent March 2025, awaiting response. Critical VA lien shortfall issue ($86K lien vs $25K max recovery) being addressed with VA OGC. File organization completed 12/1/2025 - all 150 files properly categorized in 8-bucket system with standardized naming conventions.",
        "last_status_update": "2025-09-12T07:53:40.576426+00:00",
        "client_address": "7857 US 460 W, Mize, KY 41352",
        "client_phone": "406-370-1672",
        "client_email": "michaelcrader67@gmail.com",
        "accident_date": "2023-05-19",
        "total_medical_bills": 124412.22,
        "total_expenses": 422.22,
        "total_liens": 86505.91,
        "case_last_activity": "12/01/2025 04:45 PM",
        "case_create_date": "2023-09-06",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Michael-Johnston-WC-05-03-2023",
        "client_name": "Michael Johnston",
        "case_summary": "Workers' Compensation case for right foot fracture injury sustained at Ford Kentucky Truck Plant on 5/3/2023. Client underwent ORIF surgery 5/4/2023 and received treatment at UL Hospital ER, UL Podiatry (post-op follow-up, work restrictions), and KORT Physical Therapy. Returned to work with restrictions 6/5/2023. UniCare provided TTD/STD benefits 5/4-5/21/2023. Medical records obtained from 6 providers: UL Hospital, UL Podiatry, KORT Physical Therapy, Kentucky Truck Plant Medical, Ford Motor Company Medical, and Oasis Space Medical Equipment. Total medical bills $4,736.90. Case expenses $2,145 (ChartSwap records fees). Currently in Treatment phase with active litigation: deposition scheduled 11/14/2025, IME scheduled 12/18/2025 with Arch Care Consultants, discovery request dated 9/9/2025. All case files reorganized 12/1/2025 using 8-bucket system with 121 files properly categorized across Client, Medical Records, Insurance, Expenses, and Litigation folders.",
        "current_status": "Treatment Phase with Active Litigation - Deposition scheduled 11/14/2025, IME scheduled 12/18/2025. Case files fully reorganized and ready for deposition preparation and settlement negotiations.",
        "last_status_update": "2025-12-01T16:35:00+00:00",
        "client_address": "8723 Running Fox Circle, Louisville, KY 40291",
        "client_phone": "502-442-5378",
        "client_email": "redjohnston82@gmail.com",
        "accident_date": "2023-05-03",
        "total_medical_bills": 4736.9,
        "total_expenses": 2145,
        "total_liens": 0,
        "case_last_activity": "12/01/2025 04:35 PM",
        "case_create_date": "2023-08-22",
        "phase": "Treatment",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Michael-Lanier-MVA-6-28-2025",
        "client_name": "Michael Lanier",
        "case_summary": "Motor vehicle accident on 6/28/2025. Client treated for cervical/lumbar complaints and headaches at Allstar Chiropractic (6 visits, 7/16/2025-8/13/2025, $1,635.00 total charges). Case moved to Demand in Progress phase on 10/24/2025. Medical records and bills received 10/31/2025. Child case under parent project The-Laniers-MVA-8-28-2025.",
        "current_status": "Demand in Progress - Medical records complete, ready for demand preparation",
        "last_status_update": "2025-12-01T16:35:00+00:00",
        "client_address": "1344 Wilshire Court, Union, KY 41091",
        "client_phone": "(859) 818-2804",
        "client_email": null,
        "accident_date": "2025-06-28",
        "total_medical_bills": 1635,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "12/01/2025 04:35 PM",
        "case_create_date": "2025-09-05",
        "phase": "Demand in Progress",
        "case_role": "child",
        "parent_project_name": "The-Laniers-MVA-8-28-2025"
      },
      {
        "project_name": "Morgan-Freeman-MVA-12-31-2021",
        "client_name": "Morgan Freeman",
        "case_summary": null,
        "current_status": null,
        "last_status_update": null,
        "client_address": "231 Eagle Ln, , New Albany, IN 47150-6129",
        "client_phone": "(812) 914-6950 Home",
        "client_email": "morgandanielle9418@gmail.com",
        "accident_date": "2021-12-31",
        "total_medical_bills": 8309.1,
        "total_expenses": 0,
        "total_liens": 420.54,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2023-03-27",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Muhammad-Alif-MVA-11-08-2022",
        "client_name": "Muhammad Alif",
        "case_summary": "Muhammad Alif (DOB: 04/16/1961) sustained head/spine injuries with TBI in MVA on 11/08/2022 when defendant Jacquelyn B. Wickliffe (Harbor House of Louisville employee) failed to yield and merge properly. Client treated extensively at 18+ medical providers including Parkridge Medical Center (ER), neurological specialists, physical therapy, and TBI/concussion therapy. Total medical bills exceed $57,000 with settlements negotiated. Case filed as Jefferson Circuit Court No. 23-CI-005509. Insurance coverage: Farmers PIP exhausted ($10k limit), West Bend Mutual BI coverage ($1M limit, current offer $13k), Farmers UIM available, USAA 3rd party pending. Client's litigation demands sent 07/05/2023, low settlement offer received, complaint filed leading to current active litigation phase.",
        "current_status": "Active litigation - Trial scheduled 10/14/2025. Final pretrial conference 09/10/2025 at 11:30 AM. Client completed required IMEs with Dr. Chris Stephens (07/02/2025) and Dr. Richard Edelson (07/11/2025). Expert depositions being coordinated: Dr. William Hwang (07/17/25), Dr. Van Boven (07/29/25), Dr. Fortin (08/14/25). Case proceeding toward trial with discovery completed and settlement discussions ongoing with West Bend Mutual ($13k offer pending).",
        "last_status_update": "2025-09-12T01:39:12.99809+00:00",
        "client_address": "2139 Lexington Rd #116, Louisville, KY 40206",
        "client_phone": "(502) 956-3965 Personal Mobile",
        "client_email": "stimulus110@yahoo.com",
        "accident_date": "2022-11-08",
        "total_medical_bills": 0,
        "total_expenses": 1552.8,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 04:46 PM",
        "case_create_date": "2022-11-21",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Muhammad-Alif-MVA-12-09-2022",
        "client_name": "Muhammad Alif",
        "case_summary": null,
        "current_status": null,
        "last_status_update": null,
        "client_address": "2139 Lexington Rd #116, Louisville, KY 40206",
        "client_phone": "(502) 956-3965 Personal Mobile",
        "client_email": "stimulus110@yahoo.com",
        "accident_date": "2022-12-09",
        "total_medical_bills": 76781.42,
        "total_expenses": 25,
        "total_liens": 30024.45,
        "case_last_activity": "11/19/2025 04:47 PM",
        "case_create_date": "2022-12-30",
        "phase": "Negotiation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Nayram-Adadevoh-MVA-7-13-2024",
        "client_name": "Nayram Adadevoh",
        "case_summary": "Motor vehicle accident case involving client Nayram Adadevoh and co-plaintiff Abby Sitgraves versus CAAL Worldwide limousine company. Accident occurred July 13, 2024. Client sustained injuries requiring emergency treatment at Jewish Hospital ($7,317) and University of Louisville Physicians ($180), with additional treatment at Foundation Radiology ($155) and Advocate Medical Group ($198). Total medical expenses: $7,850. Case filed in Jefferson Circuit Court (25-CI-000133) on January 8, 2025. Currently in active discovery phase with defendant's answer filed 3/24/2025 and discovery responses exchanged. Settlement demands have been submitted for both PIP ($10,000 coverage through National Indemnity Company, claim #633859-N, adjuster Jordan Bahr) and UM claims, though UM claims processing is delayed pending medical proofs for co-plaintiff. Outstanding lien from Chicago Public Schools increased to $1,093.02 (from $877.61). Comprehensive file reorganization completed 12/1/2025 with 100% accuracy - all 127 files organized into 8-bucket system with standardized naming conventions. Priority actions include scheduling depositions for both plaintiffs, resolving discovery disputes, and following up on UM claims processing.",
        "current_status": "Case overview updated 12/1/25. In active discovery phase with defendant's answer filed and discovery responses exchanged. Settlement demands submitted for PIP and UM claims with National Indemnity Company. Medical documentation complete ($7,850 total bills). File reorganization completed 12/1/25 - all documents properly categorized and ready for continued litigation. Priority actions: schedule depositions, resolve discovery disputes, follow up on UM claims processing delays due to pending medical proofs for co-plaintiff.",
        "last_status_update": "2025-12-01T16:40:00.000000+00:00",
        "client_address": "18016 chantilly LN, Hazel crest, IL 60429",
        "client_phone": "773-544-8931",
        "client_email": "nayramad@yahoo.com",
        "accident_date": "2024-07-13",
        "total_medical_bills": 7850,
        "total_expenses": 187.96,
        "total_liens": 1093.02,
        "case_last_activity": "2025-12-01",
        "case_create_date": "2024-07-23",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Nicole-Tewes-MVA-7-5-2025",
        "client_name": "Nicole Lynn Tewes",
        "case_summary": "Motor vehicle accident case for Nicole Lynn Tewes, DOB 09-28-87. Accident occurred 7/5/2025. Client sustained neck and back of head pain injuries. Treated at St Elizabeth Florence Emergency on night of accident, followed up with PCP Mary Mann on 7/29/25 who prescribed muscle relaxers and recommended chiropractic care (not yet started). Medical bills: St Elizabeth Florence ($412.89 + $1,000 collection notice), Radiology Associates ($183.00), Kroger Pharmacy (prescription). Total identified medical bills: $1,595.89. Vehicle was total loss handled through Erie Insurance. Two insurance companies involved: Erie Insurance (PIP claim A00006928311, adjuster Leigh King) and Progressive Insurance (BI claim 25-407673172, adjuster Nachand Downs). Letters of representation sent to both insurers on 7/28/25. Medical records requests sent 10/29/25. Client contact: 859-652-1483, noeticnikki@gmail.com. Spouse Joseph (Alex) Tewes very involved as primary contact. Case progressed to Demand in Progress phase 11/18/25. Comprehensive file organization completed 12/1/25 - all 46 files organized into 8-bucket system with 100% naming compliance.",
        "current_status": "Demand in Progress phase (as of 11/18/25). Treatment concluded. Medical records requests sent 10/29/25 to St Elizabeth Florence and The Christ Hospital Physicians. Medical bills identified: $1,595.89 total. File organization completed 12/1/25 - all documents properly categorized and ready for demand preparation. Need to: 1) Obtain complete medical records/bills from all providers 2) Prepare demand package 3) Address collection notice from St Elizabeth. Statute of limitations: 7/5/2027.",
        "last_status_update": "2025-12-01T16:35:00.000000+00:00",
        "client_address": "",
        "client_phone": "859-652-1483",
        "client_email": "noeticnikki@gmail.com",
        "accident_date": "2025-07-05",
        "total_medical_bills": 1595.89,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "12/01/2025 04:35 PM",
        "case_create_date": "2025-07-23",
        "phase": "Treatment",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Nyiana-Davis-MVA-6-14-2025",
        "client_name": "Nyiana Davis",
        "case_summary": "Motor vehicle accident case for Nyiana Davis involving collision on 6/14/25 at corner of Lexington Rd. and Payne St., Louisville. Client was passenger in Lyft (driver: Justice Akubia) when driver ran red light and t-boned another vehicle. Police Report #25067954. Insurance companies: Mobilitas (PIP/BI claim #2500262226 - PIP adjuster Brandon Igbo-Nwoke, BI adjuster Martin Trujillo) and Progressive (PIP/BI claim #25-806916369 - adjuster Kim Francis). Letters of representation sent 6/17-6/18/25. Progressive PIP coverage denied per 7/22/25 letter. Medical treatment: UofL Hospital immediately post-accident, then Starlite Chiropractic 6/16-7/10/25 ($8,060 billed/settled). Client completed treatment 7/23/25 due to dissatisfaction with provider. Lost wage documentation submitted to Mobilitas. Case entered demand phase 7/23/25.",
        "current_status": "Case in Demand in Progress phase as of 7/23/25. Starlite Chiropractic treatment completed and bills settled at $8,060. Progressive PIP coverage denied. Mobilitas PIP/BI coverage still pending confirmation. Lost wage documentation submitted to Mobilitas 7/24/25. University of Louisville Hospital records/bills still needed. Next actions: obtain UofL Hospital treatment records and billing, follow up on Mobilitas coverage confirmations and lost wage processing, prepare demand package for BI coverage, and complete comprehensive case review per overdue to-do from 8/29/25.",
        "last_status_update": "2025-09-12T08:00:10.17543+00:00",
        "client_address": "1836 Eastern Parkway, Apt B, Louisville, KY 40204",
        "client_phone": "502-851-1119",
        "client_email": "nyianadavis0@gmail.com",
        "accident_date": "2025-06-14",
        "total_medical_bills": 8060,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2025-06-16",
        "phase": "Negotiation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Owen-Lindsey-MVA-12-01-2024",
        "client_name": null,
        "case_summary": null,
        "current_status": null,
        "last_status_update": null,
        "client_address": null,
        "client_phone": null,
        "client_email": null,
        "accident_date": "2024-12-01",
        "total_medical_bills": 28197.07,
        "total_expenses": 50,
        "total_liens": 18606.51,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2024-12-04",
        "phase": "Settlement",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Prince-Ngabonziza-MVA-5-27-2025",
        "client_name": "Prince Ngabonziza",
        "case_summary": "Motor vehicle accident case for Prince Ngabonziza (DOB: 2/9/2002, SSN: 002-51-5738, Phone: 502-705-2996, Address: 3005 Frank Lee Ave Louisville KY 40216). Accident occurred 5/27/2025 at 1am in Kokomo, Indiana on 2970 W. State Road (Kokomo Police jurisdiction). Client was passenger in Enterprise rental Chevy Trax (RA #8C01RC, License FP284336) driven by Rafiki Nsanzabandi when they rear-ended another vehicle at red light while coming from Michigan. Client transported to St. Elizabeth South by Taylor Blvd with neck and back right side injuries. Currently treating at Starlite Chiropractic. Intake documents completed and signed 6/3-6/4/2025. Have Enterprise rental agreement, injury photos (Wound-1 through Wound-4), and UofL Health insurance information sheet. Insurance: Elco Insurance claim established 6/11/2025 but no claim number provided yet, pending adjuster assignment and coverage confirmation. Medical records and bills not yet requested from providers. No accident report obtained yet. Case progressed from Lead (6/2/2025) to Potential New Client to File Setup (6/11/2025).",
        "current_status": "File Setup complete. Immediate action items: 1) Obtain accident report from Kokomo Police for 5/27/2025 incident, 2) Follow up with Elco Insurance for claim number and adjuster assignment (promised callback not received since 6/11), 3) Add St. Elizabeth South ER to medical providers table, 4) Request medical records and bills from St. Elizabeth South and Starlite Chiropractic, 5) Confirm treatment start/end dates and visit count for Starlite Chiropractic, 6) Calendar statute of limitations deadline (5/27/2027 - 2 years from accident date). Case ready to move to active discovery phase pending insurance adjuster assignment and medical record collection.",
        "last_status_update": "2025-09-12T08:02:36.063533+00:00",
        "client_address": "3005 Frank lee Ave, Louisville, KY 40216",
        "client_phone": "502-705-2996",
        "client_email": "",
        "accident_date": "2025-05-27",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2025-06-02",
        "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Qortez-Jordan-MVA-2-14-2025",
        "client_name": "Qortez Jordan",
        "case_summary": "MVA case for Qortez Jordan injured 2/14/25. Client transported by EMS to U of L Hospital with neck and left thigh pain (thigh pain complicated by gunshot wound 6 days prior). Treated at Starlite Chiropractic 2/18-4/22/25 (23 visits). Total medical bills $15,131, with $10,026 paid/settled leaving $5,105 outstanding. Insurance: MGM (BI) claim #VA20251695511 w/ adjuster Dennis Corley; State Farm (PIP) claim #17-Q610-2P9 w/ adjuster Molly McAndrews. Demand $50K sent 5/1/25, received $4K offer 5/21/25. Key issue: Adjuster disputing left thigh treatment due to pre-existing gunshot wound. All medical records/bills received. Client received multiple legal funding advances. Recent client contact challenges (phone shows disconnected per 7/1/25 note). Case ready for continued settlement negotiations.",
        "current_status": "Settlement negotiations ongoing - Demand $50K sent 5/1/25, received $4K initial offer 5/21/25. Adjuster disputing left thigh pain due to prior gunshot wound. All medical records complete, treatment finished 4/22/25. Client contact issues noted (phone disconnected). Need to follow up on settlement negotiations and client contact.",
        "last_status_update": "2025-09-12T02:00:58.947124+00:00",
        "client_address": "6118 Guardian Ct, Apt 1, Louisville, KY 40212",
        "client_phone": "502-755-0779",
        "client_email": "",
        "accident_date": "2025-02-14",
        "total_medical_bills": 15131.4,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2025-02-19",
        "phase": "Settlement",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Rayshawn-Wilson-MVA-4-10-2025",
        "client_name": "Rayshawn Wilson",
        "case_summary": "MVA case involving Rayshawn Wilson vs. Quintez Massey at intersection 19th and Chestnut on 4/10/2025. Client sustained left wrist, back, and neck injuries. Statute of limitations: 4/10/2027.\n\nPROGRESS COMPLETED:\n- Police report obtained (Traffic Collision Report)\n- Progressive PIP claim established (claim #25806894629) - coverage still pending since 4/16/2025\n- Letter of representation sent to Progressive 4/16, follow-up sent 5/19/2025\n- At-fault vehicle confirmed to have no insurance coverage per collision check\n- 4 medical providers identified: UofL Health-Mary & Elizabeth Hospital, Foundation Radiology Group PC, Southeastern Emergency Services LLC, Starlite Chiropractic\n- Medical record requests sent 5/19/2025 to Foundation Radiology and Southeastern Emergency Services\n- Hospital records issue: Client went to St. Mary's ER but UofL Health reports no records found - discrepancy needs resolution\n- Multiple intake forms, authorizations and UofL attestations completed\n- Accident photos obtained (3 images)\n- Client contacted 4/14/2025 for initial intake\n\nCRITICAL DIRECTIVE FROM AARON WHALEY (7/17/2025):\n\"Double check and see if Rayshawn has any insurance or household insurance. If not set up KAC then decline and close.\"\n\nIMMEDIATE ACTIONS REQUIRED:\n1. **PRIORITY**: Verify client's insurance/household coverage per Aaron's directive\n2. If no coverage found, set up Keep and Close (KAC) then decline and close case\n3. Resolve St. Mary's vs UofL Health hospital discrepancy for ER records  \n4. Follow up on Progressive PIP coverage status (pending since 4/16)\n5. Complete medical records collection from all providers\n\nCASE STATUS: Case pending closure decision based on client insurance verification. Aaron Whaley has directed to close case if no insurance/household coverage found.",
        "current_status": "PENDING CLOSURE - Awaiting Insurance Verification",
        "last_status_update": "2025-09-11T22:01:57.265251+00:00",
        "client_address": "4707 Kerrick Lane, APT 102, Louisviklle, KY 40258",
        "client_phone": "502-755-1271",
        "client_email": "",
        "accident_date": "2025-04-10",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2025-04-14",
        "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Rebecca-Lanier-MVA-6-28-2025",
        "client_name": "Rebecca Lanier",
        "case_summary": null,
        "current_status": null,
        "last_status_update": null,
        "client_address": "6103 Top Hat Ct, , Louisville, KY 40258",
        "client_phone": "(859) 905-9096 Personal Mobile",
        "client_email": "rblanier3432@gmail.com",
        "accident_date": "2025-06-28",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "09/07/2025 10:36 AM",
        "case_create_date": "2025-09-05",
        "phase": "File Setup",
        "case_role": "child",
        "parent_project_name": "The-Laniers-MVA-8-28-2025"
      },
      {
        "project_name": "Robin-Wilder-Hamilton-MVA-6-15-2023",
        "client_name": "Robin Wilder-Hamilton",
        "case_summary": "Robin Wilder Hamilton MVA on 6/15/23 in Rowan County. Client sustained shoulder injury, neck injury with muscle spasms causing loss of neck curvature, and migraines requiring permanent muscle relaxers 3x daily and Botox injections every 11 weeks. Treated at VA Medical Center Lexington ($7,824.64), Scioto Valley Chiropractic ($685), and The Body Shop PT ($1,245) for total medical bills of $9,754.64. Car belonged to Wilburn Silas. Auto Owners Insurance provides PIP coverage (claim 300-0377210-2023, adjuster Donald Thomas). Sea Harbor Insurance provides BI coverage for other driver (claim C0119952, adjuster Micheal Mcgee). Demand of $35K sent 6/6/24, current offer $4K as of 2/6/25. Property damage claim stalled as Sea Harbor cannot contact vehicle owner. Car remains in tow yard nearly 3 years. Client frustrated with case duration and frequently requests updates.",
        "current_status": "Negotiating BI settlement with Sea Harbor Insurance. Current offer $4K vs $35K demand. Awaiting response to counteroffer. Property damage claim on hold - insurer unable to contact vehicle owner Wilburn Silas. Client continues ongoing medical treatment. Next action: Follow up with adjuster on settlement negotiations.",
        "last_status_update": "2025-09-11T12:04:47.673496+00:00",
        "client_address": "9062 KY 344, Vanceburg, KY 41179",
        "client_phone": "606-375-2403",
        "client_email": "catsforever_99@yahoo.com",
        "accident_date": "2023-06-15",
        "total_medical_bills": 9754.64,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2023-07-27",
        "phase": "Negotiation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Robin-Willis-Beck-Premise-09-21-2023",
        "client_name": "Robin Willis-Beck",
        "case_summary": "Premise liability case involving client Robin Willis Beck who fell and broke her ankle at the Louder Than Life music festival on 9/21/23. Filed suit against Danny Wimmer Presents (event promoter) in Jefferson Circuit Court (24-CI-000532). Previously dismissed other defendants (KY State Fair Board, Kevin McCoy, Shawn Hensler). Client treated at multiple facilities with total medical bills of approximately $7,853. Soundview Claims Solutions providing BI coverage. Defense counsel is Steven Lowery from Reminger Co., L.P.A.",
        "current_status": "Active settlement negotiations ongoing - current defense offer $15,000 (7/29/25) vs our reduced demand of $45,000. Discovery in progress with corporate rep deposition pending. Two critical items due TODAY (9/12/25): Discovery responses from defense and scheduling corporate rep deposition. OVERDUE: Client needs to review current settlement offer. Medical records collection substantially complete but some follow-up needed on outstanding requests.",
        "last_status_update": "2025-09-12T08:08:49.019806+00:00",
        "client_address": "1214 Pigeon Pass Road, Louisville, KY 40213",
        "client_phone": "502-260-2827",
        "client_email": "rlwbeck2018@outlook.com",
        "accident_date": "2023-09-21",
        "total_medical_bills": 7852.96,
        "total_expenses": 410.75,
        "total_liens": 1926.79,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2023-11-07",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Robyn-Hester-WD-MVA-02-23-2022",
        "client_name": "Robert Sneed",
        "case_summary": "Wrongful death case involving Robyn Hester (deceased) from February 23, 2022 motor vehicle accident. Multi-party litigation in Marshall County Circuit Court (23-CI-00073) with estate matter (23-P-00040). Robert Sneed III serving as estate administrator with Chabrielle Darnish Hester as key party. Multiple defendants including Mayiquel Toussaint and various trucking companies. Significant settlements already achieved: Progressive Insurance $962,500 and Geico Insurance $30,000 (both settled 10/22/2024). Active litigation continues with Ryder National Liabilities Office coverage pending. Complex case with numerous cross-claims between defendants. Trial preparation ongoing with expert disclosures, witness lists, and pretrial compliance documents filed in May 2025. Case consolidated from multiple actions. Settlement approval order entered in estate matter 23-P-00040. Extensive discovery completed including depositions, document production, and subpoenas. Multiple motions for summary judgment and judgment on pleadings pending with various defendants.",
        "current_status": "Appeals filed for experts and against all-in trucking for causation.  ",
        "last_status_update": "2025-09-12T08:09:03.17748+00:00",
        "client_address": "PO Box 72, Taylor, LA 71080",
        "client_phone": "318-639-8196",
        "client_email": "sneed42@outlook.com",
        "accident_date": "2022-02-23",
        "total_medical_bills": 0,
        "total_expenses": 33560.1,
        "total_liens": 175764.11,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2022-12-23",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Roxanne-Simpson-MVA-9-27-2023",
        "client_name": "Roxanne Simpson",
        "case_summary": "Roxanne Simpson MVA case from 9/27/2023 in Elizabethtown, KY. Police Report #23-029832. Client was cited for DUI (not alcohol-related); other driver failed to yield and there's a witness. ER treatment at Baptist Health Hardin via Hardin County EMS. Medical providers: Baptist Health Hardin ($24,743.23), Radiology Associates ($525), EMS ($894.60), Elizabethtown Emergency Physicians. All medical bills settled. State Farm BI claim #1756T368R with adjuster Kip Gunnells - coverage confirmed but client initially found at fault, then reassessed due to other driver failure to yield. Client completed treatment and case ready for demand. Documents include police report, medical records/bills, HIPAA authorizations, contact letters.",
        "current_status": "URGENT: Cannot contact client since March 2025 despite multiple attempts (calls, texts, emails, contact letters). Case ready for demand with medical treatment completed and bills settled. State Farm coverage confirmed but liability dispute continues. Need to resolve client contact issue before proceeding with demand.",
        "last_status_update": "2025-09-12T02:14:51.134957+00:00",
        "client_address": "804 Saint John Rd, Elizabethtown, KY 42701",
        "client_phone": "539-525-4907",
        "client_email": "roxandkev23@gmail.com",
        "accident_date": "2023-09-27",
        "total_medical_bills": 26162.83,
        "total_expenses": 116.39,
        "total_liens": 0,
        "case_last_activity": "11/19/2025 03:48 PM",
        "case_create_date": "2023-11-20",
        "phase": "Demand in Progress",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Sariya-Mason-DB-08-19-2022",
        "client_name": "Schrice Thomas",
        "case_summary": "Dog bite it's on video.",
        "current_status": "Mediation scheduled or file motion for summary judgment",
        "last_status_update": null,
        "client_address": "2328 Quinn Dr, , Louisville, KY 40216-2941",
        "client_phone": "(502) 365-0787",
        "client_email": "schricethomas@gmail.com",
        "accident_date": "2022-08-19",
        "total_medical_bills": 1325,
        "total_expenses": 536.01,
        "total_liens": 0.74,
        "case_last_activity": "11/12/2025 12:14 AM",
        "case_create_date": "2022-08-24",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Sean-May-MVA-8-19-2025",
        "client_name": "Sean May",
        "case_summary": "Motor vehicle accident case for Sean May involving collision on 8/19/2025 at 13th and Broadway, Louisville. Client suffered back pain injuries and received initial treatment at Norton West Louisville, currently treating at Starlite Chiropractic. Police report #25-097403 obtained. State Farm PIP coverage confirmed (Claim #1789H664T, Adjuster: Summer Garrett), letter of representation sent with policy documents received 9/5/25. Other driver Rumpke BI coverage identified with adjuster Michael Rally contacted. Initial case documentation and insurance communications established.",
        "current_status": "File setup completed with police report and initial insurance communications. Next actions: Request medical records/bills from Norton West Louisville and Starlite Chiropractic, establish formal claim with Rumpke BI coverage, schedule client follow-up within 2 weeks, add statute of limitations deadline (8/19/2027) to calendar.",
        "last_status_update": "2025-09-08T23:25:22.491518+00:00",
        "client_address": "48311 Hale Ave\nLouisville, KY 40211",
        "client_phone": "502-817-7825",
        "client_email": "unknown@unknown",
        "accident_date": "2025-08-19",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/11/2025 10:41 PM",
        "case_create_date": "2025-09-05",
        "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Shakeith-Simon-MVA-2-16-2025",
        "client_name": "Shakeith Simon",
        "case_summary": "CASE SETTLED - Shakeith Simon rear-end MVA from 2/16/25 has been successfully resolved through UM coverage with National General Insurance.\n\nCASE OVERVIEW:\nClient: Shakeith \"Keith\" Simon, 502-802-1822, sjsimon270@gmail.com\nAccident: February 16, 2025 rear-end collision at red light in Jeffersontown\nInjuries: Neck and back pain requiring pain management and chiropractic care\nPolice Report: A0252826 (Jeffersontown Police Department)\n\nTREATMENT COMPLETED:\n• Eriksen Chiropractic Centers-Radcliff: 3/3/25-4/4/25, $4,445.00 billed\n• Kentucky Pain Associates: 3/11/25-4/16/25, 3 visits, $1,757.60 billed\nTotal Medical Bills: $6,202.60\n\nINSURANCE RESOLUTION:\n• National General PIP (#250151830): Coverage pending, no collision coverage\n• National General UM (#250229255): $25,000 demand sent 7/17/25, settlement achieved\n• Commonwealth Casualty BI (#COH-0004148): Coverage denied (driver not insured)\n\nSETTLEMENT PAYMENTS TO PROVIDERS:\n• Eriksen Chiropractic: $3,926.16 paid from settlement\n• Kentucky Pain Associates: $1,741.44 paid from settlement\n• Total Settlement Payments: $5,667.60\n\nDOCUMENTATION COMPLETE:\n45+ documents on file including police report, medical records/bills, PIP applications, demand letter, LORs, medical authorizations, and settlement documentation.\n\nCase successfully resolved through National General UM coverage with all medical expenses paid from settlement proceeds. Case file is complete, organized, and closed.\n\nFILE ORGANIZATION (12/1/25):\nComprehensive 5-phase file reorganization completed by Roscoe (AI Paralegal). 39 files organized into 8-bucket directory system with 100% naming convention compliance. All files follow standard naming format (YYYY-MM-DD - Client - Category - Originator - Description). All PDFs have companion .md files. Files organized by: Case Information (10), Client (4), Investigation (2), Medical Records (24 across 2 providers), Insurance (27 across PIP/BI/UIM/PD), Negotiation Settlement (5), Reports (5). 9 duplicates removed. Full documentation in Reports/ directory.",
        "current_status": "Settled - Medical Bills Paid Through UM Coverage",
        "last_status_update": "2025-09-12T08:13:03.43689+00:00",
        "client_address": "156 Wintergreen Drive, Radcliff, KY 40160",
        "client_phone": "502-802-1822",
        "client_email": "sjsimon270@gmail.com",
        "accident_date": "2025-02-16",
        "total_medical_bills": 6202.6,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "12/01/2025 7:56 PM",
        "case_create_date": "2025-02-25",
        "phase": "Settlement",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Shannon-Colvin-MVA-10-1-2023",
        "client_name": "Shannon Colvin",
        "case_summary": "Shannon Colvin (minor) v. Paul Rafferty MVA case from 10/1/2023. Litigation filed 9/10/2024 in Hardin Circuit Court (#24-CI-01568). Discovery phase active with defendant's responses received. Medical treatment at Baptist Health Hardin ER, Zip Clinic (records/bills received, $245 settled), and other providers. State Farm PIP coverage pending, Kentucky Farm Bureau BI confirmed but denied. Colleen Colvin (grandmother) serves as co-plaintiff and guardian. Outstanding medical records from Elizabethtown Emergency Physicians (90+ days overdue), Baptist Health Hardin, and Radiology Associates. Ready to proceed with depositions pending complete medical records.",
        "current_status": "Discovery phase active. Awaiting overdue medical records from Elizabethtown Emergency Physicians (3rd request sent Dec 2024, 90+ days overdue), Baptist Health Hardin, and Radiology Associates. Defendant's discovery responses received. Client discovery responses filed 1/29/2025. Next: Follow up on overdue medical records, prepare for depositions once records complete.",
        "last_status_update": "2025-09-12T02:20:45.609922+00:00",
        "client_address": "128 South St, Radcliff, KY 40160",
        "client_phone": "270-219-9740",
        "client_email": "",
        "accident_date": "2023-10-01",
        "total_medical_bills": 245,
        "total_expenses": 276.18,
        "total_liens": 145.72,
        "case_last_activity": "12/01/2025 7:50 PM",
        "case_create_date": "2023-11-10",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Shannon-Lankswert-WC-02-07-2025",
        "client_name": "Shannon Lankswert",
        "case_summary": "Workers' Compensation claim for 3rd shift UPS fueler who fell down metal stairs in fuel yard on 02/07/2025, striking back and both arms/elbows. Initial treatment at Concentra (employer-directed), followed by Flaget Memorial Hospital ER. Primary ongoing treatment with Advanced Injury Rehab in Bardstown. Injuries: Lumbar spine contusion, sacroiliac joint sprain, right elbow contusion, cervical radiculopathy. WC Carrier: Liberty Mutual (Claim #WC80D-H07503). Defense Counsel: Lucas & Dietz. TTD benefits initially disputed but eventually approved. Client unable to return to work due to restrictions UPS cannot accommodate.",
        "current_status": "File organization completed (94.7% - 177 of 187 files organized). Case files now standardized in 8-bucket system with proper naming conventions. Medical records organized by 6 providers. 10 files remain in root requiring manual review.",
        "last_status_update": "2025-12-01",
        "client_address": "118 Cumberland Court, Bardstown, KY 40004",
        "client_phone": "(502) 435-4834",
        "client_email": "smm75mj@msn.com",
        "accident_date": "2025-02-07",
        "total_medical_bills": 4023.36,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "12/01/2025 07:50 PM",
        "case_create_date": "2025-02-17",
        "phase": "Closed",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Shawna-Broyles-MVA-08-26-2022",
        "client_name": "Shawna Broyles",
        "case_summary": "This is a federal trucking accident case (WDKY 3:23-cv-00133-DJH) involving Shawna Broyles who sustained maxillofacial fractures and dental injuries in a commercial vehicle accident on August 26, 2022. The case involves BSL Express Trucking, Inc. and driver Kurbonov as defendants, with Protective Insurance providing BI coverage but denying liability claiming our client ran a red light. The case includes joint representation with co-plaintiff Emilee Bradley.\n\nCurrent Litigation Status: Depositions completed including client deposition (3/22/24) and Officer Austin Taylor deposition (3/12/24). Expert testimony motions have been filed and responses submitted regarding Dr. Barefoot's expert opinion. The court has issued an opinion/order excluding Dr. Barefoot expert testimony with some aspects denied. A telephonic status conference was held with Magistrate Judge Regina S. Edwards on September 9, 2025. Case remains in active federal litigation with pending court decisions.\n\nMedical Treatment: Completed at UofL Hospital ($23,434.20), Starlite Chiropractic ($4,725.00), Norton Community Medical ($305.00), Aptiva Health ($250.00), UofL Physicians ($1,567.00), and Louisville Metro EMS ($814.60), with ongoing dental care at UofL School of Dentistry. Total medical expenses: $30,095.80.\n\nInsurance Status: Progressive PIP has paid $8,026.64 in benefits. UM coverage of $2,550 available through Progressive. Protective Insurance denied BI claim. Client works as line worker at Ford earning $35.28/hour. Current phone: (502) 741-7917.",
        "current_status": "Active Federal Litigation - Post-Conference Status (9/9/25 magistrate conference completed). Awaiting court decisions on expert testimony motions. Next actions to be determined based on court rulings.",
        "last_status_update": "2025-09-12T08:16:16.223535+00:00",
        "client_address": "7010 Glendale Rd, , Louisville, KY 40291",
        "client_phone": "(502) 579-3814 Personal Mobile",
        "client_email": "shawnabroyles224@gmail.com",
        "accident_date": "2022-08-26",
        "total_medical_bills": 31095.8,
        "total_expenses": 1494.55,
        "total_liens": 3867.91,
        "case_last_activity": "11/12/2025 12:08 AM",
        "case_create_date": "2022-08-29",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Shaylynn-Keeney-MVA-02-24-2025",
        "client_name": "Shaylynn Keeney",
        "case_summary": "Shaylynn Keeney MVA case from 2/24/2025 in Louisville, KY. Client sustained cervical strain and mid back pain, transported by PRP EMS to UofL Mary & Elizabeth Hospital. Treated at Starlite Chiropractic for 20 visits. Total medical bills $12,408 paid by State Farm PIP. Demand sent 7/22/2025 for $25,000 to UM adjuster Steve Campbell. All medical records obtained. Vehicle total loss settled for $12,656.52. Client has both PIP and UM coverage through State Farm (claim #1780Z939M).",
        "current_status": "Negotiation phase - $25,000 demand sent to State Farm UM adjuster Steve Campbell on 7/22/2025. Awaiting response from insurance company. All medical treatment completed and records obtained. PIP benefits exhausted with $12,408 in medical bills paid.",
        "last_status_update": "2025-09-12T08:17:37.447667+00:00",
        "client_address": "2311 S 7st Rd, Louisville, KY 40214",
        "client_phone": "502-615-2417",
        "client_email": "shaylynnkeeney@icloud.com",
        "accident_date": "2025-02-24",
        "total_medical_bills": 12408,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/12/2025 12:23 AM",
        "case_create_date": "2025-02-25",
        "phase": "Settlement",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Sir-Hinkle-MVA-6-23-2025",
        "client_name": "Sir Hinkle",
        "case_summary": "Sir Hinkle MVA case from 6/23/2025 on Dixie Highway, Louisville. Property damage settled with Sedgwick for $12,000. Client treating with Starlite Chiropractic for back/shoulder injuries sustained in accident. Previously represented by Morgan & Morgan - representation conflict resolved. Police report obtained (LMPD #25071781). Insurance: Sedgwick BI (Meredith Spencer, 225-368-3472) and State Farm PIP. All representation letters sent. Intake completed, case now in active treatment phase.",
        "current_status": "Active treatment phase - client receiving chiropractic care at Starlite Chiropractic. Property damage resolved ($12K settlement). Next: Obtain medical records/bills from UofL Southwest Valley Station and Starlite Chiropractic. Monitor treatment completion. PIP processing with State Farm ongoing.",
        "last_status_update": "2025-09-12T02:04:23.845479+00:00",
        "client_address": "4125 Dienes Way, Louisville, KY 40216",
        "client_phone": "502-468-8499",
        "client_email": "",
        "accident_date": "2025-06-23",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/11/2025 12:14 PM",
        "case_create_date": "2025-06-27",
        "phase": "Treatment",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Stevie-Hawks-MVA-3-8-2024",
        "client_name": "Stevie Hawks",
        "case_summary": "CASE: Stevie Martin Hawks MVA (Hit & Run) - 03/08/2024\n\nACCIDENT DETAILS:\n• Date/Time: March 8, 2024 at 3:00 AM, Bowling Green, KY\n• Type: Hit-and-run, client was \"run over,\" other driver fled scene\n• Emergency Response: Police arrived 3:30 AM, client transported to Medical Center at Bowling Green, then airlifted to TriStar Skyline Medical Center in Tennessee\n• Police Report: Obtained from Bowling Green PD (Traffic Collision Report available)\n\nINSURANCE COVERAGE:\n• State Farm Insurance Company - PIP only (Claim #17-Q1275R5)\n• Adjuster: Brad Murray (W: 844-292-8615, Ext: 518-884-6175, F: 844-218-1140)\n• PIP Status: EXHAUSTED as of 02/05/25 - No further benefits available\n• Coverage Limitations: NO Bodily Injury (BI) or Uninsured Motorist (UM) coverage available\n• Client has no personal auto insurance (does not own vehicle)\n\nMEDICAL TREATMENT:\n• Air Evac Lifeteam 62: Emergency transport - $66,738.50 (settled via PIP)\n• The Medical Center At Bowling Green: Initial emergency treatment\n• TriStar Skyline Medical Center: Follow-up care\n• Med Center Health Primary Care: Primary care provider\n• Radiology Alliance, PC: Radiology services\n• Medical records partially obtained, some providers rejected initial requests requiring additional information\n\nCLIENT INFORMATION:\n• Name: Stevie Martin Hawks\n• Contact: 270-783-1635 (primary), 270-421-4910 (alternate)\n• Client became frustrated in January 2025, accused firm of being scam (communication breakdown resolved)\n\nCASE CHALLENGES:\n• Limited recovery potential due to no BI/UM coverage\n• Client relationship strain due to coverage limitations\n• Complex medical record collection process",
        "current_status": "Case in CLOSING phase as of 07/17/25. PIP benefits exhausted ($66,738.50 paid to Air Evac). No BI or UM coverage available limits recovery options. Medical records collection ongoing with some provider rejections requiring follow-up. Client communication challenges resolved. Preparing closing documentation and final case summary. Closing letter to client pending per case workflow requirements.",
        "last_status_update": "2025-09-12T01:55:35.990857+00:00",
        "client_address": "3139 Scottsville Rd, Rm 313, Bowling Green, KY 42104",
        "client_phone": "270-783-1635",
        "client_email": "steviehawks0@gmail.com",
        "accident_date": "2024-03-08",
        "total_medical_bills": 66738.5,
        "total_expenses": 0,
        "total_liens": 19953.34,
        "case_last_activity": "11/12/2025 12:34 AM",
        "case_create_date": "2024-09-16",
        "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Test-Client-3-MVA-10-15-2025",
        "client_name": null,
        "case_summary": null,
        "current_status": null,
        "last_status_update": null,
        "client_address": null,
        "client_phone": null,
        "client_email": null,
        "accident_date": null,
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": null,
        "case_create_date": "2025-10-15",
        "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "test-client-MVA-10-16-2025",
        "client_name": null,
        "case_summary": null,
        "current_status": null,
        "last_status_update": null,
        "client_address": null,
        "client_phone": null,
        "client_email": null,
        "accident_date": null,
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": null,
        "case_create_date": "2025-10-16",
        "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "The-Laniers-MVA-8-28-2025",
        "client_name": "The Laniers",
        "case_summary": null,
        "current_status": null,
        "last_status_update": null,
        "client_address": "",
        "client_phone": "5025555555",
        "client_email": "unknown@unknown",
        "accident_date": "2025-08-28",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/11/2025 11:32 PM",
        "case_create_date": "2025-09-07",
        "phase": "File Setup",
        "case_role": "parent",
        "parent_project_name": null
      },
      {
        "project_name": "The-Otts-MVA-8-06-2025",
        "client_name": "The Otts",
        "case_summary": null,
        "current_status": null,
        "last_status_update": null,
        "client_address": "",
        "client_phone": "502-616-6505",
        "client_email": "unknown@unknown",
        "accident_date": "2025-08-06",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/12/2025 12:04 AM",
        "case_create_date": "2025-09-07",
        "phase": "File Setup",
        "case_role": "parent",
        "parent_project_name": null
      },
      {
        "project_name": "Timothy-Ruhl-Premise-09-14-2023",
        "client_name": "Timothy Ruhl",
        "case_summary": "Timothy Ruhl v. Hoosier Cargo Express, et al. (Jefferson 24-CI-005896) - Premises liability case from September 14, 2023 incident (assault in apartment complex parking lot) resulting in chronic back pain and low back injuries. Client has incurred $31,414.73 in medical bills across 12 medical providers with $5,781 already paid in settlements to X-ray Associates ($1,254) and Pain Management Centers of America ($4,527), leaving $25,633.73 outstanding. Settlement demand of $100,000 sent April 15, 2025. Shelter Insurance coverage denied (Claim GL00000003555090, Adjuster: Sharon Wills). Active litigation with three defendants: Austin Whitman (unserved), Trey Cooper (rep by Sewell & Neal PLLC), and Hoosier Cargo Express LLC (rep by Phillips Parker Orberson & Arnett PLC). Plaintiff's deposition scheduled August 14, 2025. Discovery ongoing with plaintiff's interrogatories sent to defendants May 15, 2025. SSA authorization forms completed May 2025. Difficulty serving Austin Whitman preventing Answer and discovery responses. Defense counsel requesting medication lists and additional documentation. Client experiencing ongoing health challenges, financial stress (March 2025 eviction notice), and apartment mold/water damage issues. One pending to-do: send medication list to defense counsel by 8/29/25.",
        "current_status": "Active Litigation - Discovery Phase, Deposition Scheduled for August 14, 2025",
        "last_status_update": "2025-09-12T08:23:02.058836+00:00",
        "client_address": "391 Barricks Road, Lot 302B, Louisville, KY 40229",
        "client_phone": "901-376-5489",
        "client_email": "timothy.ruhl21@gmail.com",
        "accident_date": "2023-09-14",
        "total_medical_bills": 31414.74,
        "total_expenses": 616.29,
        "total_liens": 1799.53,
        "case_last_activity": "11/10/2025 10:15 PM",
        "case_create_date": "2024-07-22",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Torrey-Green-MVA-9-03-2025",
        "client_name": "Torrey Green",
        "case_summary": null,
        "current_status": null,
        "last_status_update": null,
        "client_address": "4304 Pruitt Ct\nLouisville, KY 40218",
        "client_phone": "502-965-6091",
        "client_email": "torreygreen284@yahoo.com",
        "accident_date": "2025-09-03",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "09/07/2025 10:36 AM",
        "case_create_date": "2025-09-05",
        "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Trasandra-Miller-MVA-5-30-2025",
        "client_name": "Trasandra Miller",
        "case_summary": null,
        "current_status": null,
        "last_status_update": null,
        "client_address": "6433 Molly Ridge Way, Apt 101, Louisville, KY 40228",
        "client_phone": "502-314-0819",
        "client_email": "",
        "accident_date": "2025-05-30",
        "total_medical_bills": 6135,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/12/2025 12:40 AM",
        "case_create_date": "2025-06-02",
        "phase": "Settlement",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Tyler-Marzec-MVA-2-26-2024",
        "client_name": "Tyler Marzec",
        "case_summary": "Motor vehicle accident case for Tyler Marzec involving a 2/26/24 collision in Lexington, KY while client was driving for Door Dash. Client treated at UK Good Samaritan Hospital ER on 3/9/24 with total medical bills of $9,153.47. Four insurance companies involved: SafeCo (BI coverage, primary claim #56240577), Progressive (BI coverage denied), Blue Star Claims (occupational accident coverage), and The General (PIP coverage). Demand sent to SafeCo on 7/25/25 for $25,000. Case challenges include difficulty contacting client - phone disconnected multiple times, mail returned. Medical records still pending from UK Hospital despite multiple requests. Statute of limitations: 2/26/26.",
        "current_status": "Awaiting response from SafeCo Insurance on $25,000 demand sent 7/25/25. Key outstanding items: 1) Obtain medical records from UK Good Samaritan Hospital (multiple requests sent, records still pending), 2) Re-establish client contact (phone disconnected, mail returned), 3) Follow up with SafeCo adjuster Douglas Hare on settlement response. Next actions: Contact UK Hospital for medical records status, attempt client contact through alternative means, follow up with SafeCo on demand response timeline.",
        "last_status_update": "2025-09-12T08:25:47.706288+00:00",
        "client_address": "215 J R Reynolds Rd, Eubank, KY 42567",
        "client_phone": "859-267-7225",
        "client_email": "",
        "accident_date": "2024-02-26",
        "total_medical_bills": 9153.47,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "11/12/2025 12:59 AM",
        "case_create_date": "2024-05-14",
        "phase": "Negotiation",
        "case_role": "solo",
        "parent_project_name": null
      },
      {
        "project_name": "Wayne-Weber-MVA-01-01-2022",
        "client_name": "Wayne Weber",
        "case_summary": "Wayne Weber MVA case from January 1, 2022. Client transported by EMS to Norton Brownsboro Hospital after being struck by defendant Fenwick who failed to yield while turning left. Extensive medical treatment with 22+ providers including emergency care, orthopedics, vascular surgery, nephrology, and eye specialists. Total medical bills exceed $11,000. Insurance: State Farm BI coverage ($50K limits, liability accepted, prior offer $800) and Kentucky Farm Bureau PIP (subrogation completed). Client deposition completed April 15, 2025 via Zoom. Opposing counsel: Allison Rief (Dilbeck & Myers). Demand drafted and sent to opposing attorney September 24, 2025. Case overview completed September 24, 2025. Awaiting response from opposing attorney. Attempted client contact (voicemail September 24, 2025).",
        "current_status": "Demand drafted and sent to opposing attorney (September 24, 2025). Case overview completed. Awaiting response from opposing attorney. Attempted client contact (voicemail September 24, 2025).",
        "last_status_update": "2025-09-24T18:24:02.022698+00:00",
        "client_address": "11815 Cedardale Rd, Louisville, KY 40223",
        "client_phone": "502-773-1181",
        "client_email": "altoption@aol.com",
        "accident_date": "2022-01-01",
        "total_medical_bills": 11170.7,
        "total_expenses": 1037.27,
        "total_liens": 0,
        "case_last_activity": "11/12/2025 12:20 AM",
        "case_create_date": "2023-11-06",
        "phase": "Litigation",
        "case_role": "solo",
        "parent_project_name": null
      }
    ]
  },
  {
    "project_name": "Lori-House-MVA-11-19-2025",
    "client_name": "Lori House",
    "case_type": "MVA",
    "accident_date": "2025-11-19",
    "intake_date": "2025-11-21",
    "current_phase": "File Setup",
    "last_update": "2025-12-01",
    "last_activity": "2025-12-01",
    "case_summary": "T-bone collision at 15th and Hill (4-way stop). Client was traveling north on 15th when struck in back passenger side by defendant traveling west on Hill. Hit and run incident. LMPD involved. Client reports mid and lower back pain with some sciatica. No treatment to date as of 11/21/2025.",
    "injuries": "Mid and lower back pain, sciatica",
    "liability_notes": "Hit and run - defendant fled scene",
    "insurance_carrier": "Liberty Mutual (PIP)",
    "status": "Active - File Setup"
  },
  {
    "jsonb_agg": [
      {
        "project_name": "Michae-Guyton-MVA-11-14-2025",
        "client_name": "Michae Guyton",
        "case_summary": "Multi-party motor vehicle accident case involving Michae Guyton (DOB 8/6/1997, SSN 330-94-6903) along with Antonio Lopez, A'zaire Lopez, and Mi'Ayla Lopez. Accident occurred 11/14/2025 at Eaton and Dixie Highway intersection - rear-end collision at traffic light. Client transported to UofL Hospital downtown with injuries including back pain and both shoulders. Progressive PIP coverage (claim #25695180369) with special instructions: reserve $4,000 in benefits, use $6,000 for bills, DO NOT pay hospital or hospital-related bills. Auto Owners BI coverage (claim #300-0701136-2025). Letters of representation sent 11/18/2025 to both carriers. Fee Agreement: 33.36% pre-suit, 40% post-suit. Intake documents signed via Vinesign 11/17/2025. County Clerk insurance information request sent for at-fault vehicle plate J8Z536. Case files fully organized into 8-bucket system 12/1/2025 with 100% naming compliance and 0% error rate.",
        "current_status": "File Setup - Treatment Phase Beginning. Letters of representation sent and acknowledged by Progressive PIP (11/18/2025). Auto Owners BI letter sent 11/18/2025. Client completed intake via Vinesign 11/17/2025. Investigation initiated with County Clerk request for at-fault driver insurance information. Client treated at UofL Hospital downtown on date of accident. Awaiting client to begin ongoing treatment and provide treatment provider information. Case files fully organized 12/1/2025. Next actions: (1) Welcome call to client at 502-701-5196, (2) Confirm treatment providers and enter in system, (3) Monitor PIP benefit usage per special instructions, (4) Follow up on County Clerk insurance information request, (5) Request medical records from UofL Hospital when treatment progresses.",
        "last_status_update": "2025-12-01T16:10:00.000000+00:00",
        "client_address": "5056 Minette Court, Apt 3, Louisville, KY 40258",
        "client_phone": "502-701-5196",
        "client_email": "",
        "accident_date": "2025-11-14",
        "total_medical_bills": 0,
        "total_expenses": 0,
        "total_liens": 0,
        "case_last_activity": "12/01/2025 04:10 PM",
        "case_create_date": "2025-11-17",
        "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      }
    ]
  }
] "phase": "File Setup",
        "case_role": "solo",
        "parent_project_name": null
      }
    ]
  }
]